import { createSlice } from '@reduxjs/toolkit'

const initialValue = {
  Recipes: [
    {
      id: 1,
      name: "מוס גבינה חלבה",
      time: "שעה",
      ingredients: [
        {
          title: "לבסיס בייגלה",
          ingredientsList: [
            "3 כוסות בייגלה טבעות שומשום (130 גר')",
            "100 גר שוקולד חלב מומס",
            "⅓ כוס טחינה גולמית (80 גר')"
          ]
        },
        {
          title: "לקרם חלבה",
          ingredientsList: [
            "250 גר שוקולד לבן",
            "⅔ כוס טחינה גולמית (150 גר')",
            "כפית קפה מגורען מומס בכפית מים רותחים"
          ]
        },
        {
          title: "למוס גבינה",
          ingredientsList: [
            "450 גר' גבינת שמנת (2 מיכלים)",
            "500 מל שמנת מתוקה (2 מיכלים)",
            "3 כפות א. סוכר",
            "6 גר ג'לטין מומס ב 30 גר' מים קרים"
          ]
        },
        {
          title: "לגנאש שוקולד חלב",
          ingredientsList: [
            "50 גר' שמנת מתוקה",
            "כפית קפה מגורען",
            "100 גר' שוקולד חלב קצוץ",
            "כף טחינה גולמית"
          ]
        },
        {
          title: "לקישוט",
          ingredientsList: [
            "שומשום",
            "פניני שוקולד, קליק"
          ]
        }
      ],
      description: `אופן ההכנה:
        מכינים בסיס בייגלה: במעבד מזון טוחנים בייגלה עם שוקולד מומס וטחינה גולמית לקבלת פירורים לחים. מניחים שקף על דפנות הרינג, ומהדקים את התערובת לתחתית . אפשר לעלות מעט ולרפד קם חלק מהדפנות בתערובת. מקפיאים.
        מכינים קרם חלבה: ממיסים שוקולד לבן בקערה על גבי סיר עם מים רותחים (בן מארי) מוסיפים טחינה גולמית וקפה מומס במים רותחים ומערבבים היטב. יוצקים כ ½ כוס מהתערובת על תבנית סיליקון ספירלה, מטיחים את התבנית על משטח העבודה עד שכל הבועות צפות . מעבירים להקפאה.
        מכינים מוס גבינה: ממיסים את הג'לטין במים הקרים ומניחים בצד עד לספיגת הנוזלים (הנה כאן תזכרו איך בדיוק עושים את זה..) מקציפים שמנת מתוקה למרקם יוגורט, מוסיפים לה אבקת סוכר וגבינת שמנת, ואת קרם החלבה הנותר. מערבלים לאיחוד. ממיסים ג'לטין 20 שניות במיקרוגל לקבלת נוזל צלול ללא גרגירים. מוסיפים כמה כפות מבלילת הגבינה לג'לטין ומערבבים היטב. יוצקים את התערובת למוס הגבינה ומערבבים לאיחוד. יוצקים 2/3 מכמות המוס על בסיס הבייגלה. מחזירים להקפאה. את יתרת המוס מעבירים לשק זילוף וממלאים תבניות סיליקון של חצאי עיגולים או כדורים בגדלים שונים, מקפיאים.
        מכינים גנאש שוקולד חלב: מרתיחים שמנת וקפה, יוצקים על השוקולד , ממתינים כדקה וטורפים היטב. מוסיפים טחינה גולמית וטורפים שוב. מעבירים לשק זילוף עם צנטר קטן ומשונן ומצננים במקרר עד להרכבה.
        מרכיבים את העוגה: מחלצים את ספירלת קרם החלבה ומניחים על העוגה. מחלצים את כדורי מוס החלבה ומסדרים מסביב לספירלה, מזלפים גנאש שוקולד חלב בין הכדורים, מפזרים שומשום (לאחר קליה קצרה על מחבת חמה) , פניני שוקולד או קליקים שונים, כיד הדמיון הטובה.
        אפשר לשמור את העוגה בהקפאה, ולהפשיר במקרר כמה שעות לפני ההגשה. חשוב  להפשיר אותה לגמרי לפני החיתוך כדי ששכבת קרם החלבה תיחתך יפה..`,
      category: "עוגות",
      favorite: false,
      img: "/Images/1.jpg"
    }, {
      id: 2,
      name: "עוגת היער השחור",
      time: "שעה וחצי",
      ingredients: [
        {
          title: "לעוגה",
          ingredientsList: [
            "4 ביצים גדולות",
            "¾ כוס סוכר (150 גר')",
            "קורט מלח",
            "כף ליקר דובדבנים",
            "½ כפית תמצית וניל",
            "¾ כוס קמח (100 גר')",
            "4 כפות קקאו (40 גר')",
            "½ 1 כפיות אבקת אפיה"
          ]
        },
        {
          title: "לסירופ דובדבנים",
          ingredientsList: [
            "½ כוס מים (120 מל)",
            "½ כוס סוכר (100 גר')",
            "½ כוס דובדבנים חצויים",
            "3 כפות ליקר דובדבנים"
          ]
        },
        {
          title: "לגנאש שוקולד לבן מוקצף",
          ingredientsList: [
            "150 גר' שוקולד לבן חלבי / פרווה",
            "500 מל שמנת / צמחית",
            "כוס דובדבנים חצויים"
          ]
        },
        {
          title: "לעיטור",
          ingredientsList: [
            "50 גר' שוקולד מריר",
            "חופן דובדבנים טריים"
          ]
        }
      ],
      description: `אופן ההכנה: מתחילים בהכנת הגנאש: ממיסים שוקולד לבן קצוץ עם ½ כוס שמנת צמחית (120 מ"ל) במיקרו בפולסים של 30 שניות, מערבבים בין לבין עד שמתקבל גנאש חלק. ניתן לטחון באמצעות בלנדר מוט. מעבירים לצינון במקרר לכ 3 שעות, או למקפיא למשך כשעה- מערבבים מדי פעם את הגנאש כדי שלא יקפא. מכינים טורט שוקולד: בקערת מיקסר מקציפים חלבונים ומלח, מוסיפים בהדרגה את הסוכר עד לקבלת קצף יציב. מוסיפים חלמונים, ליקר ווניל ומערבלים במהירות נמוכה לאיחוד. מוסיפים קמח, קקאו ואבקת אפיה, וממשיכים לערבל באיטיות לקבלת עיסה אחידה. מחממים תנור ל 170 מעלות. לקבלת שכבות אחידות – מומלץ לאפות את העוגה ב 3 תבניות / רינגים בקוטר דומה (20 – 22 ס"מ). להקלת החילוץ מומלץ לרפד את התבניות בניר אפייה. מחלקים את העיסה בין 3 התבניות בצורה שווה ככל הניתן, משטחים בעזרת כף ואופים כ 12-15 דקות עד שהעוגות יבשות. מצננים היטב ומנתקים מניר האפיה. לחלופין – ניתן לאפות בתבנית אחת כ 35-40 דקות, ולאחר שהעוגה מצטננת לחלוטין – לפרוס אותה ל 3 שכבות שוות בעזרת סכין ארוכה ומשוננת. מכינים סירופ דובדבנים: בסיר קטן מרתיחים מים, סוכר ודובדבנים, ומבשלים כ 5 דקות. בעזרת בלנדר מוט טוחנים את התערובת ומוסיפים ליקר דובדבנים. מקציפים את הגנאש: מעבירים את גנאש השוקולד הלבן הקר לקערת מיקסר. מוסיפים את יתרת השמנת (½ 1 כוסות, 380 מ"ל) ומערבלים במהירות נמוכה לאיחוד כדקה. מגבירים את המהירות ומקציפים מספר דקות לקבלת קצפת יציבה מאד. מרכיבים את העוגה: מרפדים רינג בקוטר 20 ס"מ בשקף לאפיה מצידו הפנימי ומניחים על צלחת הגשה. מסדרים שכבת טורט שוקולד ראשונה בתוך הרינג, כשפני העוגה כלפי מטה. בעזרת מברשת מברישים סירופ דובדבנים בנדיבות על העוגה. בעזרת כף משטחים כשליש מהגנאש המוקצף על שכבת העוגה ומפזרים עליה דובדבנים חצויים. מניחים שכבת עוגה נוספת על הקצפת, ושוב – מספיגים אותה בסירופ דובדבנים, משטחים שליש נוסף מכמות הקצפת ואת יתרת הדובדבנים. מכסים בשכבת העוגה השלישית ומספיגים גם אותה בסירופ דובדבנים. מעבירים להתייצבות במקפיא לכחצי שעה עד שעה (לא יותר), ומעבירים את יתרת הקצפת למקרר. מעטרים: מסירים את הרינג והשקף מדפנות העוגה. משטחים כ 2 כפות גדושות מהקצפת על פני העוגה, ואת יתרת הקצפת מעבירים לשק זילוף עם פיה משוננת. מזלפים ספירלה ארוכה בהיקף העוגה ומסדרים עליה את הדובדבנים השלמים. את השוקולד המריר מגרדים במגרדת גסה ומפזרים במרכז העוגה.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/2.jpg"
    },
    {
      id: 3,
      name: "כוסות מוס חלבה ושוקולד",
      time: "שעה",
      ingredients: [
        {
          title: "חומרים",
          ingredientsList: [
            "250 גר' שוקולד מריר",
            "250 גר' שוקולד לבן פרווה",
            "כוס חלב שקדים או ½ כוס שמנת צמחית + ½ כוס מים",
            "2 כפות טחינה גולמית (50 גר')",
            "קורט מלח",
            "2 מכלי שמנת צמחית (500 מל)",
            "לעיטור: 50 גר' חלבה"
          ]
        }
      ],
      description: `אופן ההכנה:
                קוצצים את השוקולד הלבן והמריר ומניחים כל אחד מהם בנפרד בכלי צר ועמוק.
                בסיר קטן מביאים לרתיחה כוס חלב / שמנת צמחית ומים . יוצקים מחצית מהנוזל הרותח על השוקולד הלבן, ומחצית על השוקולד המריר. ממתינים דקה וטוחנים את השוקולד הלבן בעזרת בלנדר מוט. מוסיפים 2 כפות טחינה גולמית וקורט מלח ומערבבים.
                ממשיכים לטחון את תערובת השוקולד המריר לאיחוד בעזרת בלנדר מוט.
                בקערת מיקסר מקציפים 2 מכלי שמנת צמחית. מוסיפים למחצית מהקצפת – את תערובת השוקולד הלבן, ולמחצית השנייה – את תערובת השוקולד המריר.
                מעבירים כל אחת מהתערובות לשק זילוף ומזלפים לכוסות הגשה לפי טעמכם – תחילה את המוס הלבן, ולאחריו את המוס הכהה או להיפך. מעטרים בחלבה מפוררת.
                שומרים בהקפאה, מעבירים למקרר מספר שעות לפני ההגשה.אופן ההכנה:
                קוצצים את השוקולד הלבן והמריר ומניחים כל אחד מהם בנפרד בכלי צר ועמוק.
                בסיר קטן מביאים לרתיחה כוס חלב / שמנת צמחית ומים . יוצקים מחצית מהנוזל הרותח על השוקולד הלבן, ומחצית על השוקולד המריר. ממתינים דקה וטוחנים את השוקולד הלבן בעזרת בלנדר מוט. מוסיפים 2 כפות טחינה גולמית וקורט מלח ומערבבים.
                ממשיכים לטחון את תערובת השוקולד המריר לאיחוד בעזרת בלנדר מוט.
                בקערת מיקסר מקציפים 2 מכלי שמנת צמחית. מוסיפים למחצית מהקצפת – את תערובת השוקולד הלבן, ולמחצית השנייה – את תערובת השוקולד המריר.
                מעבירים כל אחת מהתערובות לשק זילוף ומזלפים לכוסות הגשה לפי טעמכם – תחילה את המוס הלבן, ולאחריו את המוס הכהה או להיפך. מעטרים בחלבה מפוררת.
                שומרים בהקפאה, מעבירים למקרר מספר שעות לפני ההגשה.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/3.jpg"
    },
    {
      id: 4,
      name: "מוס נוגט לימוני",
      time: "חצי שעה",
      ingredients: [
        {
          title: "לקראמבל שקדים",
          ingredientsList: [
            "1/2 כוס פחות כף סוכר חום (100 גר')",
            "כוס שקדים טחונים עם / בלי קליפה (100 גר')",
            "1/2 כוס + 2 כפות קמח (90 גר')",
            "100 גר' חמאה / מרגרינה",
            "קורט מלח"
          ]
        },
        {
          title: "למוס נוגט",
          ingredientsList: [
            "8 גר' ג'לטין + 45 גר' מים קרים",
            "1/4 1 כוסות מחית נוגט (300 גר')",
            "100 גר' שוקולד לבן חלבי או פרווה איכותי",
            "1/2 כוס פחות 2 כפות חלב או חלב שקדים (100 גר')",
            "2 כוסות שמנת מתוקה או צמחית (500 מל)",
            "גרידה מלימון גדול"
          ]
        },
        {
          title: "לציפוי",
          ingredientsList: [
            "300 גר' שוקולד מריר",
            "2 כפות שמן"
          ]
        }
      ],
      description: `
                    אופן ההכנה:
                    מכינים קראמבל: מערבלים סוכר, שקדים, קמח מלח וחמאה במעבד מזון או מיקסר עם וו גיטרה לקבלת גושי בצק. מפוררים את הבצק לגושים קטנים ומפזרים באופן אחיד על תבנית תנור מרופדת בניר אפיה . אופים בתנור מחומם ל 170 מעלות כ 20 דקות עד שהבצק מזהיב אך לא נשרף. אפשר לערבב את הפירורים מדי כמה דקות לאפייה אחידה.
                    מצננים היטב ומפוררים שוב לקבלת חתיכות בגודל הרצוי.
                    מכינים את הג'לטין לשימוש: בכלי קטן מערבבים אבקת ג'לטין ומים קרים ומשהים לספיחה כ 15 דקות. הוראות מפורטות יותר לשימוש בג'לטין תוכלו לקרא כאן.
                    מכינים מוס נוגט: במיכל גבוה ממיסים שוקולד לבן במיקרו בפולסים של 30 שניות וערבוב בין לבין . ניתן גם להמיס את השוקולד בשיטת "בין מארי" באמצעות הנחת השוקולד הלבן בקערת זכוכית או נירוסטה על גבי סיר עם מים רותחים תוך כדי ערבוב.
                    השוקולד הלבן עדין מאד ולכן כדאי להזהר מפני חימום יתר שיגרום למרקם גרגירי ולא נעים.
                    מוסיפים לשוקולד המומס מחית נוגט ומערבבים לאיחוד. מניחים את הג'לטין הספוג על התערובת.
                    בסיר קטן מרתיחים חלב וגרידת לימון, יוצקים את החלב החם על תערובת השוקולד והנוגט. ממתינים מעט וטוחנים בעזרת בלנדר מוט. מצננים את התערובת בטמפרטורת חדר עד שהיא פושרת למגע.
                    בקערת מיקסר מקציפים את השמנת לקצפת יציבה. מנמיכים את מהירות המיקסר ומוסיפים את תערובת השוקולד-נוגט.
                    יוצקים את המוס לתבניות ארטיקים: מכניסים את מקל הארטיק לשקע המיועד לו לפני מילוי המוס. יוצקים את המוס, מנערים את התבניות בעדינות כדי שהתערובת תמלא את כל החריצים ולא ישארו כיסי אויר , ומחליקים את פני המוס בעזרת פלטה מדורגת לקבלת שכבה אחידה וישרה. מקפיאים לילה.
                    את שארית המוס ניתן למלא בתבנית סיליקון כדורים ולהקפיא. את הכדורים נצפה בשוקולד ונניח כקישוט על כוסות המוס.
                    ניתן כמובן לוותר על כדורי המוס ורק למלא את הכוסות: מחלקים כף קראמבל בתחתית כל כוס ומנערים אותה מעט לקבלת פיזור אחיד של הפירורים.יוצקים מוס נוגט עד לגובה 2/3 מהכוסות ומקפיאים לילה.
                    מחלצים: את הארטיקים והכדורים מתבניות הסיליקון במהירות, מניחים על מגש מרופד בניר אפיה ומחזירים למקפיא עד לטבילה.
                    מצפים בשוקולד: בקערת זכוכית ממיסים שוקולד מריר במיקרו בפולסים של 30 שניות וערבוב בין לבין. מוסיפים שמן צמחי כדי לדלל את השוקולד ולקבל ציפוי דק יותר. טובלים את הארטיקים הקפואים בזריזות בשוקולד המריר. כדאי להוציא כל ארטיק מהמקפיא מיד לפני הטבילה. אני עובדת איתם אחד אחד כדי שישארו קפואים היטב לפני הציפוי.
                    את הארטיקים מניחים על צלחת עם פירורי קראמבל לייבוש השוקולד. בזמן שהשוקולד עדיין רך ניתן להצמיד קישוטים נוספים כמו שברי אגוזים וקראמבל, ולהוסיף אבקת זהב למראה נוצץ. מחזירים למקפיא עד להגשה.
                    את הכדורים טובלים בשוקולד באמצעות שיפוד שנועצים בכדור. נועצים את השיפוד בחתיכת קלקר עד להתקשות השוקולד. מניחים את הכדורים על מוס הנוגט שקפא בכוסות. מעטרים באגוזים , שאריות קראמבל, או חתיכות קטנות של חטיף שוקולד וחמאת בוטנים, אותו ניתן להכין גם בגרסת ממרח נוגט במקום חמאת בוטנים.
                    שומרים במקפיא, מעבירים למקרר כשעה לפני ההגשה.
                    `,
      category: "עוגות",
      favorite: false,
      img: "/Images/4.jpg"
    },
    {
      id: 5,
      name: "סורבה פירות בשני צבעים",
      time: "45 דקות",
      ingredients: [
        {
          title: "לסורבה תות",
          ingredientsList: [
            "2 כוסות גדושות תותים טריים / מופשרים",
            "1/2 כוס סוכר (100 גר')",
            "מיץ מחצי לימון",
            "כפית תמצית וניל",
            "קורט מלח",
            "1 כוס שמנת מתוקה / צמחית",
            "2 כוסות גדושות קוביות קרח"
          ]
        },
        {
          title: "לסורבה אננס-פסיפלורה",
          ingredientsList: [
            "1 כוס קוביות אננס (קפוא או שימורים)",
            "1 כוס מחית פסיפלורה (קפואה או מיץ טרי)",
            "1/2 כוס סוכר (100 גר')",
            "מיץ מחצי לימון",
            "כפית תמצית וניל",
            "קורט מלח",
            "1 כוס שמנת מתוקה / צמחית",
            "2 כוסות גדושות קוביות קרח"
          ]
        }
      ],
      description: `
                        אופן ההכנה:
                        מכינים סורבה תותים : מניחים תותים, סוכר, מיץ לימון, וניל, מלח ושמנת במיכל מעבד מזון עם סכין פלדה. טוחנים הכל למחית חלקה.
                        מוסיפים קרח וטוחנים לדקה עד שהקרח מתפורר אך עדיין מורגש בתערובת.
                        מוזגים לתבניות סיליקון קטנות ומקפיאים, או מעבירים את הסורבה למיכל גבוה ונוח למזיגה ומאכסנים במקפיא בזמן הכנת הסורבה הצהוב.
                        מכינים סורבה אננס פסיפלורה באותו אופן בדיוק – טוחנים את כל החומרים מלבד הקרח תחילה, ואז מוסיפים את הקרח וטוחנים שוב.
                        מוזגים לתבניות סיליקון קטנות ומקפיאים, או מעבירים למיכל גבוה ונוח למזיגה.
                        מניחים על משטח תבנית אינגליש קייק או מיכל רחב. מחזיקים מיכל סורבה צהוב ביד אחת וורוד בשנייה, שופכים בו זמנית את הסורבה לתבנית כך ששני צדדי התבנית מתמלאים במקביל. מקפיאים מיד.
                        צורות הגשה: אפשר להניח קוביות סורבה צבעוניות בכוסות אישיים ולעטר בפירות העונה, או באמצעות כף גלידה קפיצית לגרוף כדורי סורבה מעורבבים משני צבעים.`,
      category: "קינוחים",
      favorite: false,
      img: "/Images/5.jpg"
    },
    {
      id: 6,
      name: "כוסות שוקולד נוגט",
      time: "שעה",
      ingredients: [
        {
          title: "קרם נוגט",
          ingredientsList: [
            "1/4 כוס מים (60 גר')",
            "3/4 כוס שמנת צמחית (180 גר')",
            "200 גר' שוקולד לבן פרווה קצוץ",
            "2 כפות ממרח נוגט"
          ]
        },
        {
          title: "קוביות שוקולד פריכות",
          ingredientsList: [
            "150 גר' שוקולד מריר",
            "150 גר' מרגרינה",
            "1/2 כוס + כף סוכר חום בהיר (120 גר')",
            "1/4 כוס סוכר (50 גר')",
            "קורט מלח",
            "1/2 כפית תמצית וניל",
            "1/4 1 כוסות קמח (175 גר')",
            "3 כפות קקאו (30 גר')",
            "כפית סודה לשתייה (5 גר')",
            "2 כפות מים – לפי הצורך"
          ]
        },
        {
          title: "מוס שוקולד נוגט",
          ingredientsList: [
            "4 ביצים מופרדות",
            "2 כפות סוכר (40 גר')",
            "200 גר' שוקולד מריר",
            "2 כפות ממרח נוגט",
            "1 שמנת צמחית (240 גר')"
          ]
        }
      ],
      description: `אופן ההכנה:
                            מכינים קרם נוגט: מחממים שמנת צמחית ומים בסיר קטן לסף רתיחה, מכבים את האש ומוסיפים ממרח נוגט
                            מוסיפים לנוזל החם שוקולד לבן פרווה קצוץ ומחית נוגט, ממתינים דקה.
                            טורפים היטב. אפשר גם לטחון בבלנדר מוט לקבלת קרם אחיד וחלק.
                            מעבירים לשק זילוף וממלאים את כוסות ההגשה עד לרבע מגובה הכוס, כ 15 גר' אם מדובר ב 25 מנות. מעבירים לצינון במקפיא.
                            עוברים לקוביות שוקולד פריכות: מעבירים שוקולד מריר לקערת מעבד המזון ומעבדים לפירורים גסים.
                            מוסיפים את שאר חומרי הבצק: מרגרינה, סוכרים, קמח ותבלינים. ממשיכים לעבד עד לקבלת בצק אחיד, אם הבצק לא מתגבש – מוסיפים מעט מים.
                            מחממים תנור ל 170 מע'. מרדדים את בצק השוקולד בין שני נירות אפיה לגובה של כחצי ס"מ. מסירים את ניר האפייה העליון ואופים 15 דקות עד להתייצבות. הבצק נראה מעט רך במרכז, אל דאגה הוא יתייצב בהמשך.
                            מצננים את הבצק לגמרי וחותכים אותו לקוביות קטנות בגודל של כ 1*1 ס"מ.
                            מניחים חופן קוביות מעל קרם הנוגט, עד לגובה חצי הכוס ומחזירים למקפיא.
                            מכינים מוס שוקולד: מקציפים חלבונים עם סוכר לקצף יציב.
                            בקערת מיקסר נוספת מקציפים שמנת צמחית.
                            בזמן ההקצפה, מעבירים שוקולד מריר לקערה חסינת חום וממיסים במיקרו במשך מספר פעמים, למשך 30 שניות בכל פעם. מערבבים את השוקולד בכל פעם כדי שלא יישרף.
                            מוסיפים את השוקולד המומס, החלמונים וממרח הנוגט לחלבונים המוקצפים, עדיין במיקסר במהירות נמוכה.
                            מקפלים את השמנת המוקצפת לתערובת השוקולד, ומערבבים לקבלת מוס אחיד.
                            מעבירים את המוס לשק זילוף עם צנטר משונן ומזלפים מעל הקוביות הפריכות בכוסות.
                            מעטרים בשברי שוקולד.
                            `,
      category: "עוגות",
      favorite: false,
      img: "/Images/6.jpg"
    },
    {
      id: 7,
      name: "עוגת מוס ריבת חלב",
      time: "שעה",
      ingredients: [
        {
          title: "בסיס אלפחורס",
          ingredientsList: [
            "100 גר' קוביות חמאה קרה",
            "1/2 כוס אבקת סוכר (60 גר')",
            "שקית סוכר וניל (10 גר')",
            "כוס פחות 2 כפות קורנפלור (120 גר')",
            "1/2 כוס + כף קמח (80 גר')",
            "כפית אבקת אפיה (6 גר')",
            "1 חלמון",
            "כף חלב (במידת הצורך)"
          ]
        },
        {
          title: "לספוג שקדים",
          ingredientsList: [
            "2 חלבונים (50 גר')",
            "3 כפות סוכר (30 גר')",
            "4 ביצים (200 גר')",
            "כוס + כף שקדים טחונים (150 גר')",
            "חצי כוס + כף סוכר (110 גר')",
            "1/4 כוס שמן (60 גר')",
            "ריבת חלב – למריחה"
          ]
        },
        {
          title: "לקרמו פסיפלורה",
          ingredientsList: [
            "2 גר ג'לטין + 10 גר מים קרים",
            "50 גר' שמנת מתוקה",
            "25 גר' מחית פסיפלורה",
            "1.5 כפות סוכר (15 גר')",
            "חלמון ביצה (20 גר)",
            "110 גר שוקולד לבן"
          ]
        },
        {
          title: "לקרמו שוקולד חלב",
          ingredientsList: [
            "2 גר' ג'לטין + 10 גר' מים קרים",
            "100 גר' חלב",
            "1/2 כוס שמנת מתוקה (120 גר')",
            "כף דבש (20 גר')",
            "2 חלמונים (40 גר')",
            "250 גר' שוקולד חלב קצוץ"
          ]
        },
        {
          title: "למוס ריבת חלב",
          ingredientsList: [
            "6 גר' ג'לטין + 30 גר' מים קרים",
            "200 גר' שוקולד לבן קצוץ",
            "250 גר' ריבת חלב",
            "1/4 כוס חלב (60 גר')",
            "500 מל שמנת מתוקה"
          ]
        }
      ],
      description: `אופן ההכנה:
                                1. בצק אלפחורס: מניחים חמאה, סוכרים, קורנפלור קמח ואבקת אפיה במעבד מזון ומעבדים לפירורים דקים. מוסיפים חלמון ומוסיפים לעבד עד לקבלת בצק אחיד, מוסיפים חלב במידת הצורך. מצננים את הבצק במקרר כשעה.
                                2. על משטח מקומח מעט מרדדים את הבצק לעובי של כחצי ס"מ. בעזרת רינג בקוטר 18 ס"מ קורצים עיגול מהבצק המרודד. את שאריות הבצק אפשר לרדד שוב ולקרוץ עוגיות בגדלים שונים.
                                3. מכינים את הרינג הפנימי (18 ס"מ): בעזרת הרינג, מציירים עיגול בקוטר 18 ס"מ על נייר אפיה, גוזרים את העיגול. עוטפים את תחתית הרינג בנייר כסף ומהדקים היטב. מניחים מעל נייר הכסף את עיגול נייר האפייה שגזרנו, ומעליו מניחים את הבצק המרודד. מהדקים מעט לדפנות הרינג. מניחים את הרינג על תבנית תנור (כדי שיהיה קל יותר לשנע אותו ולהמשיך עם האפייה של עוגת השקדים)
                                4. אופים את הבצק כ 12 – 15 דקות בתנור מחומם ל 170 מעלות, עד להזהבה קלה.
                                5. עוגת ספוג שקדים: בקערת מיקסר מקציפים חלבונים ו 3 כפות סוכר לקבלת מרנג יציב.
                                6. בקערה נוספת מקצפים ביצים שלמות, שקדים וסוכר כדקה לקבלת קצף תפוח . מקפלים פנימה את המרנג במהירות נמוכה. מזלפים שמן וממשיכים לערבל במהירות נמוכה לקבלת תערובת אחידה.
                                7. יוצקים את העיסה מעל בצק האלפחורס האפוי, עד לגובה 1/3 מהרינג. (שאריות אפשר לאפות בתבניות סיליקון קטנות).
                                8. מחזירים את התבנית לתנור לאפיה נוספת של 20 דקות, עד להזהבה. מצננים היטב, ומורחים שכבה דקה של ריבת חלב מעל העוגה.
                                9. קרמו פסיפלורה: יוצקים מים קרים על אבקת הג'לטין המונחת בכלי קטן. מערבבים היטב ומשהים לספיגה מלאה – כ 15 דקות.
                                10. מחממים בסיר קטן שמנת, מחית פסיפלורה סוכר וחלמון ביצה.  בוחשים בעזרת מרית טובה להסמכה קלה. הקרם צריך להגיע ל 75-80 מעלות. ניתן לבדוק זאת על ידי הרמת המרית, ציור קו על הקרם בעזרת האצבע: אם השטח מתמלא מיד על ידי הנוזל – הקרם עוד לא הסמיך מספיק. אם השטח לא נסגר מיד- הקרם מוכן.
                                11. מסירים מהאש, מוסיפים לסיר את הג'לטין והשוקולד הלבן הקצוץ. ממתינים כדקה וטוחנים בבלנדר מוט.
                                12. מצננים מעט ויוצקים על שכבת עוגת השקדים. מקפיאים מספר שעות, עדיף לילה.
                                13. קרמו שוקולד חלב: יוצקים מים קרים על אבקת הג'לטין המונחת בכלי קטן. מערבבים היטב ומשהים לספיגה מלאה – כ 15 דקות.
                                14. במקביל, מחממים בסיר חלב, שמנת דבש וחלמונים להסמכה עדינה תוך כדי ערבוב מתמיד בעזרת מרית טובה. (בדיוק כמו בשלב 10)
                                15. מוסיפים לסיר את הג'לטין ושוקולד החלב הקצוץ. ממתינים כדקה וטוחנים בבלנדר מוט.
                                16. מקפיאים את הקרם: מרפדים תחתית של רינג בקוטר 18 ס"מ בניילון נצמד ומעליו מהדקים נייר כסף. מניחים על תחתית תבנית ליציבות. יוצקים את הקרמו לרינג המרופד ומקפיאים מספר שעות, עדיף לילה.
                                17. מוס ריבת חלב: יוצקים מים קרים על אבקת הג'לטין המונחת בכלי קטן. מערבבים היטב ומשהים לספיגה מלאה – כ 15 דקות.
                                18. ממיסים שוקולד לבן: מניחים שוקולד לבן קצוץ בקערת זכוכית או נירוסטה, מחממים מעל סיר מים עד להמסת השוקולד.
                                19. במקביל מחממים חלב בסיר נוסף לסף רתיחה. מסירים מהאש ומוסיפים את הג'לטין הספוג. מערבבים עד להמסת כל הג'לטין.
                                20. מוסיפים את החלב החם וריבת חלב לשוקולד הלבן המומס וממשיכים לערבב בקערה מעל סיר המים לקבלת קרם חלק וגמיש. מעבירים כ 3 כפות מהקרם לשק זילוף – למילוי עוגיות האלפחורס מהבצק שנשאר לנו.. את שאר הקרם מצננים מעט.
                                21. מקציפים שמנת מתוקה למרקם יוגורט (לא להקציף יותר מדי), מוסיפים אליה את תערובת ריבת החלב ומערבבים לאיחוד.
                                22. לטובת הקישוט – יוצקים מעט מוס ריבת חלב לתבנית סיליקון ספירלה. מנערים את התבנית היטב (כן יש שם הרבה בועות אוויר) ומקפיאים.
                                23. מרכיבים את העוגה:מרפדים תחתית של רינג רינג בקוטר 20 ס"מ בניילון נצמד ומעליו מהדקים נייר כסף. מניחים על תחתית אלומיניום לשינוע נוח.
                                24. מחלצים את בסיס העוגה (בצק אלפחורס, עוגת שקדים וקרם פסיפלורה) מהרינג הקטן ומניחים במרכז הרינג הגדול. יוצקים מחצית ממוס ריבת החלב, מניחים את שכבת קרם השוקולד הקפוא, ומסיימים עם שאר מוס ריבת החלב.
                                25. כדי לקבל את המראה המחוספס של המוס מניחים שקף או משטח סיליקון מחוספס (סילפאן) על פני המוס בזהירות. מקפיאים לילה.
                                26. מקשטים את העוגה: מחלצים את העוגה המוכנה מהרינג – אפשר על ידי חימום הדפנות בברנר, או העברת סמרטוט טבול במים רותחים. מניחים על צלחת הגשה בזהירות ומחזירים למקפיא.
                                27. ממיסים שוקולד חלב בקערה מעל מים רותחים.
                                28. ליצירת חגורה דקה – מכינים שקף על פי היקף הרינג החיצוני, גוזרים אותו לעובי הרצוי ומניחים על ניר אפיה. יוצקים מעט שוקולד חלב מומס לאורך השקף ומשטחים בעזרת פלטה מדורגת עד לכיסוי כל השקף. מרימים את השקף בזהירות ועוטפים בעזרתו את החלק התחתון של עוגת המוס. מעבירים למקרר לצינון.
                                29. ליצירת דסקית שוקולד חלב – משטחים שכבת שוקולד חלב מומס מעל שקף מדוגם. מצננים מספר דקות במקרר רק עד שהשוקולד מאבד את הברק ומתייצב אך לא מתקשה לגמרי. מניחים  רינג בקוטר 18 ס"מ על השוקולד, ובעזרת סכין חדה חותכים את דסקית השוקולד . מצננים במקפיא מספר דקות להתקשות מלאה.
                                30. ליצירת טיפות שוקולד – מעבירים מעט שוקולד חלב לשקית זילוף. מזלפים תלוליות שוקולד על רצועות ניר אפיה. בעזרת כפית "מושכים" את תלולית השוקולד לצד אחד כך שנוצרת טיפה. מניחים על משטח מעוגל (מגש בגטים או אלתורים נוספים כמו משטח גמיש המהודק באמצעות אטבי כביסה ) ומצננים במקפיא.
                                31. מחלצים בעדינות את דסקית השוקולד ומניחים אותה על פני המוס.
                                32. מחלצים את המוס מתבנית הספירלה. ומניחים אותו על דסקית השוקולד. מעטרים בפניני שוקולד וטיפות שוקולד.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/7.jpg"
    },
    {
      id: 8,
      name: "קראנץ' שמרים דפוף במלית פסק זמן",
      time: "שעתיים", 
      ingredients: [{
        title: "לבצק שמרים בסיסי",
        ingredientsList: [
          "1/2 כוס חלב (120 גר') בטמפ' חדר",
          "1/2 כפית תמצית וניל",
          "6 גר' שמרים יבשים (2 כפיות שטוחות) או 20 גר' שמרים טריים (1/2 2 כפות שטוחות)",
          "500 גר' קמח (1/2 3 כוסות + כף)",
          "2 ביצים גדולות",
          "1/3 כוס סוכר (75 גר')",
          "קורט מלח",
          "80 גר' חמאה בטמפ' חדר"
        ]
      },
      {
        title: "לקיפולי החמאה",
        ingredientsList: [
          "200 גר' חמאה בטמפ' חדר קרירה",
          "קמח – לרידוד"
        ]
      },
      {
        title: "למילוי",
        ingredientsList: [
          "כוס וחצי ממרח פסק זמן (או ממרח שוקולד)",
          "כוס שוקולד צ'יפס"
        ]
      },
      {
        title: "לסירופ סוכר",
        ingredientsList: [
          "3/4 כוס סוכר (160 גר')",
          "1/2 כוס מים (120 גר')"
        ]
      }],
      description: `אופן ההכנה:
                                  לבצק הבסיסי: בקערת מיקסר מערבבים חלב, תמצית וניל ושמרים. מוסיפים את שאר החומרים על פי הסדר: קמח, ביצים, סוכר, מלח וחמאה.
                                  לשים במיקסר בעזרת וו לישה במהירות נמוכה כ 2 דקות עד שהבצק מתאחד, אך לא חלק לגמרי. במידת הצורך עוצרים את פעולת המיקסר ומגרדים את הפירורים מתחתית הקערה. אם הבצק יבש מדי – מוסיפים מעט חלב, אם הוא דביק מדי – מוסיפים מעט קמח.
                                  ממשיכים ללוש 4 דקות נוספות עד שמתקבל בצק חלק ואלסטי.
                                  את המשך הלישה ממליץ אורי לסיים ביד: מניחים את הבצק על משטח עבודה מקומח, בעזרת כף היד "קורעים" את הבצק ומקפלים אותו על עצמו שוב. מסובבים רבע סיבוב וממשיכים בקריעה וקיפול הבצק כ 5 דקות.
                                  לחלופין ניתן להמשיך את הלישה במיקסר 5 דקות נוספות.
                                  מעבירים את הבצק המוכן לקערה מקומחת, מכסים בניילון נצמד ומשהים בטמפרטורת חדר כ 30 דקות.
                                  עוטפים את הבצק בניילון נצמד ומעבירים למנוחת לילה במקרר.
                                  לקיפולי החמאה: כעת נתחיל להטמיע את החמאה בבצק הקריר. בשלב ראשון המטרה שלנו היא להגיע לשכבת חמאה שטוחה בגודל של 18X20 ס"מ. מצאתי ששקית ה ziplock הרגילה שלי (זו עם פס פלסטיק לסגירה חוזרת) היא בדיוק בגודל הזה. אפשר להכניס פרוסות חמאה לתוך השקית ופשוט לרדד עד שכל השקית התמלאה ומתקבלת שכבה אחידה של חמאה בגודל 18X20 ס"מ. אם אין שקית מתאימה – אפשר לרדד פרוסות חמאה בין שני ניירות אפייה לגודל הרצוי.
                                  מכניסים את החמאה למקרר לצינון קל בזמן שמרדדים את הבצק על משטח מקומח מעט למלבן מדויק בגודל של 18X40 ס"מ.
                                  מחלצים את ריבוע החמאה מניר האפייה או השקית (הכי נוח לגזור אותה) ומניחים אותו בתחתית מלבן הבצק, כך שהוא מכסה בדיוק חצי עם שוליים דקים מסביבו.
                                  מקפלים את החלק הריק של הבצק על החמאה כך שהוא מכסה את כולה. מהדקים את הקצוות היטב ומסירים עודפי קמח.
                                  בשלב זה חשוב שהחמאה והבצק יהיו באותה טמפרטורה – קרירה אך לא קשה. אם החמאה תהיה חמימה מדי – היא תימס לנו בתוך הבצק ולא ייווצרו השכבות הנכספות בבצק. אם היא תהיה קרה מדי – היא תישבר במהלך הרידוד וגם אז השכבות לא ממש יורגשו.
                                  כעת מתחילים עם הקיפולים:
                                  מסובבים את ריבוע הבצק רבע סיבוב כך שה"תפר" פונה לצד ימין. מקמחים מעט ומרדדים את הבצק בזהירות למלבן בגודל 25 X 40 ס"מ. מחלקים בעין את הבצק ל 3 חלקים, ומקפלים בצורת מעטפה של ילדים: שליש תחתון של הבצק מעל החלק האמצעי שלו, והשליש העליון מעליהם בצורה חופפת ככל האפשר. מרדדים אותו מעט ועוטפים בניילון נצמד. שולחים את הבצק למנוחה של 30 דקות במקרר.
                                  מוציאים את הבצק, מניחים אותו בסיבוב כך שהתפר שוב פונה לצד ימין. מרדדים לגודל של 25 X 40 ס"מ ומקפלים למעטפה. עוטפים בניילון נצמד ומצננים במקרר 30 דקות. חוזרים על התהליך פעם נוספת ומצננים את הבצק לילה.
                                  ממלאים את הבצק סוף סוף: מקמחים מעט משטח עבודה גדול. מרדדים את הבצק לעלה בגודל 30 X 70 ס"מ בעדינות וסבלנות מרובה. אם הבצק מתכווץ ומתנגד נותנים לו לנוח מעט וממשיכים.
                                  מפזרים כפות גדושות של ממרח על הבצק, ומשטחים אותן באמצעות פלטה מדורגת לשכבה אחידה. מפזרים שוקולד צ'יפס. מגלגלים לרולדה הדוקה.
                                  חוצים את הרולדה לאורכה באמצעות סכין חדה. מסובבים את החצאים כשהחלק הפתוח פונה למעלה. מניחים את הרצועות אחת על השנייה בצורת X, ומלפפים אותן ליצירת צמה יפה וארוכה. חוצים אותה לשתיים, ומעבירים כל חלק לתבנית אינגליש קייק.
                                  מתפיחים את העוגה כשעה וחצי- שעתיים בטמפרטורת חדר חמימה.
                                  אופים בתנור מחומם ל 180 מעלות כ 40 דקות להזהבה.
                                  בינתיים מכינים סירופ סוכר – מרתיחים סוכר ומים בסיר קטן וממשיכים לבשל על אש נמוכה עד להמסת כל הסוכר. מצננים מעט.
                                  מוציאים את העוגות מהתנור ומברישים בסירופ סוכר.
                                  מצננים מעט לפני החיתוך, או מקפיאים.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/8.jpg"
    },
    {
      id: 9,
      name: "מיני מגנום פאדג' שוקולד",
      time: "שעה וחצי", 
      ingredients: [{
        title: "לסירופ פאדג' שוקולד",
        ingredientsList: [
          "כף חמאה / מחמאה (15 גר')",
          "1/3 כוס שמנת מתוקה / צמחית (80 מל)",
          "1/4 כוס דבש (85 גר')",
          "2 כפות סוכר חום כהה (20 גר')",
          "כף שטוחה קקאו (10 גר')",
          "קורט מלח",
          "כפית תמצית וניל",
          "85 גר' שוקולד מריר קצוץ"
        ]
      },
      {
        title: "למוס שוקולד",
        ingredientsList: [
          "3 גר' ג'לטין + 15 גר' מים קרים",
          "200 גר' שוקולד מריר",
          "חצי מיכל שמנת מתוקה / צמחית (125 מל)",
          "מיכל שמנת מתוקה / צמחית (250 מל)"
        ]
      },
      {
        title: "לציפוי שוקולד",
        ingredientsList: [
          "300 גר' שוקולד",
          "2 כפות שמן צמחי",
          "100 גר' אגוזים מסוכרים – קרוקנט"
        ]
      }],
      description: `אופן ההכנה:
                                      מכינים סירופ פאדג' שוקולד: מעבירים את כל החומרים לסיר קטן פרט לשוקולד המריר. מרתיחים ומבשלים מספר דקות להסמכת הסירופ. מוסיפים את השוקולד המריר וטורפים היטב לאיחוד, עדיף להשתמש בבלנדר מוט לשם כך.
                                      מעבירים לבקבוק לחיץ או כלי עם פיה צרה לשפיכה נוחה ומצננים לטמפרטורת חדר.
                                      מכינים מוס שוקולד: ממיסים את הג'לטין במים קרים ומשהים כ 15 דקות לספיחת כל הנוזלים. קוצצים את השוקולד המריר. כשהג'לטין ספוגי ומוכן לעבודה, מעבירים אותו למיכל צר וגבוה ביחד עם השוקולד המריר.
                                      מחממים חצי מיכל שמנת לרתיחה. יוצקים את השמנת הרותחת על השוקולד המריר, ממתינים דקה, וטוחנים בבלנדר מוט לקבלת קרם אחיד וחלק. מצננים לטמפרטורת חדר.
                                      במיקסר עם בלון הקצפה מקציפים שמנת מתוקה. מקפלים לתוכה את תערובת השוקולד לקבלת מוס חלק ושוקולדי.
                                      מעבירים את המוס לשק זילוף ומזלפים בתבנית ארטיקים מסיליקון עד לחצי הגובה. מזלפים מעט מסירופ השוקולד שהצטנן, ומערבבים בעזרת קיסם או שיפוד. מכניסים את מקלות הארטיק בחריץ המיועד לכך ומנערים היטב את התבנית. מזלפים את יתרת המוס למילוי השקעים, מנערים היטב את התבנית שוב ומיישרים בעזרת פלטה.
                                      מעבירים להקפאה של מספר שעות, מומלץ לילה. מחלצים את הארטיקים בזהירות מהתבנית ומקפיאים שוב לחצי שעה.
                                      מצפים את הארטיקים: בקערת זכוכית עם דופן ישרה ממיסים שוקולד מריר. ניתן לעשות זאת על ידי חימום חוזר במיקרו למשך 30 שניות וערבוב בין לבין. מוסיפים שמן ומערבבים היטב, מניחים אגוזים מסוכרים בצלחת שטוחה.
                                      עובדים בכמויות קטנות כדי להימנע מהמסת הארטיקים לפני הציפוי. טובלים כל ארטיק בשוקולד המומס, מנערים היטב מעודפי שוקולד ומניחים על צלחת האגוזים. מעבירים לניר אפיה נקייה ומחזירים להקפאה עד להגשה.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/9.jpg"
    },
    {
      id: 10,
      name: "עוגת גבינה פירורים שוקו צ'יפס",
      time: "40 דקות", 
      ingredients: [{
        title: "לבצק עוגיות שוקולד צ'יפס",
        ingredientsList: [
          "200 גר' חמאה רכה",
          "1 כוס סוכר (200 גר')",
          "1 כוס פחות 3 כפות סוכר חום כהה (200 גר')",
          "קורט מלח",
          "2 ביצים גדולות",
          "1/4 כפית סודה לשתייה",
          "3/4 2 כוסות קמח (285 גר')",
          "1/4 כוס קקאו (35 גר')",
          "200 גר' שוקולד מריר קצוץ או שוקולד צ'יפס"
        ]
      },
      {
        title: "לגנאש שני שוקולדים",
        ingredientsList: [
          "מיכל שמנת מתוקה (259 מל)",
          "150 גר' שוקולד מריר קצוץ",
          "100 גר' שוקולד חלב קצוץ"
        ]
      },
      {
        title: "לקרם גבינה",
        ingredientsList: [
          "2 מיכלים שמנת מתוקה (500 מל)",
          "1 מיכל שמנת חמוצה (200 מל)",
          "1 כוס סוכר (200 גר')",
          "1 חב' אינסטנט פודינג וניל (80 גר')",
          "500 גר' גבינה לבנה 5/9%"
        ]
      }],
      description: `אופן ההכנה:
                                      מתחילים בהכנת גנאש שני שוקולדים: בסיר קטן מחממים שמנת לסף רתיחה.
                                      מניחים את השוקולדים הקצוצים בקערה, ויוצקים עליהם את השמנת הרותחת.
                                      משהים כדקה וטורפים לתערובת חלקה בעזרת מטרפה.
                                      אפשר להכין לילה לפני הכנת העוגה, ואפשר לקרר בזריזות: מעבירים את הקערה למקפיא וטורפים כל רבע שעה את הגנאש כדי שיתקרר אך לא יקפא.
                                      כשהגנאש כבר לא נוזלי והפך לקרמי מעבירים אותו לשק זילוף, רצוי עם צנטר עגול, ומעבירים למקרר עד להרכבת העוגה.
                                     
                                      מכינים בצק עוגיות: במיקסר בעל וו גיטרה מקרימים חמאה, שני סוגי סוכר ומלח לקרם אחיד במהירות בינונית.
                                      מוסיפים ביצים, אחת אחרי השנייה עד להטמעה בתערובת.
                                      לבסוף מוסיפים את שאר החומרים היבשים: קמח, קקאו, סודה לשתייה ושוקולד צ'יפס.
                                      ממשיכים לערבל במהירות נמוכה עד לאיחוד הבצק.
                                     
                                      משטחים כמחצית מהבצק לשכבה של כחצי ס"מ בתחתית תבנית אפיה עגולה או מלבנית.
                                      את שאר הבצק משטחים באופן חופשי על מגש מרופד בנייר אפייה.
                                      אופים בתנור מחומם ל 180 מעלות כ 20 דקות, כשאת הבצק בתבנית מפוררים במהלך האפייה בעזרת שני מזלגות.
                                      נזהרים לא לאפות את הבצק יותר מדי כדי שלא יתייבש.
                                      מוציאים מהתנור ומצננים לחלוטין.
                                     
                                      מכינים קרם גבינה: בקערת מיקסר מניחים שמנת מתוקה וחמוצה, כוס סוכר ואינסטנט פודינג וניל.
                                      מקציפים מספר דקות לקבלת תערובת תפוחה וטעימה.
                                      מוסיפים פנימה את הגבינה וממשיכים לערבל במהירות נמוכה לאיחוד מלא.
                                     
                                      מרכיבים את העוגה: משטחים כחצי מקרם הגבינה מעל הבצק האפוי.
                                      מזליפים עיגולי גנאש שוקולד – בתבנית עגולה, או פסי גנאש צפופים בתבנית מרובעת.
                                      מקפיאים כ 15 דקות (כדי שהגנאש לא ימרח לנו בתוך הקרם הלבן).
                                      משטחים את שאר תערובת הגבינה ומיישרים.
                                      מפזרים את יתרת פירורי עוגיות השוקולד.
                                      מעבירים לקירור של כ 4-6 שעות לפני ההגשה.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/10.jpg"
    },
    {
      id: 11,
      name: "מקרון חגיגי במילוי גנאש שוקולד לבן",
      time: "שעתיים", 
      ingredients: [{
        title: "למקרונים",
        ingredientsList: [
          "150 גר' שקדים טחונים",
          "150 גר' אבקת סוכר",
          "55 גר' חלבונים",
          "150 גר' סוכר",
          "38 גר' מים",
          "55 גר' חלבונים"
        ]
      },
      {
        title: "למילוי",
        ingredientsList: [
          "200 גר' שוקולד לבן קצוץ",
          "100 גר' שמנת מתוקה",
          "4 כפות ריבת חלב / ריבת תות / גנאש שוקולד"
        ]
      }],
      description: `אופן ההכנה:
                                          מתחילים בהכנת הגנאש למילוי (עדיף אפילו ערב קודם): מרתיחים שמנת מתוקה, יוצקים מעל השוקולד הלבן, ממתינים כדקה וטורפים לאיחוד. מעבירים לשק זילוף ומצננים במקרר עד לשימוש.
                                         
                                          מכינים את תערובת השקדים: לקערה גדולה מנפים שקדים טחונים בנפה רגילה. את שברי השקדים הגדולים שלא עוברים בנפה – שוקלים, ומנפים כמות שקדים נוספת באותו משקל כדי להשלים ל 150 גר'. מנפים לאותה קערה גם את אבקת הסוכר.
                                          מוסיפים לאבקות 55 גר' חלבונים ומערבבים בנחישות לקבלת עיסה אחידה אך קשה למדי.
                                         
                                          עוברים למרנג האיטלקי: בסיר קטן מניחים סוכר. יוצקים עליו את המים באיטיות, וממתינים לראות שכל המים נספגים בסוכר ואין חלקים יבשים. במקביל מעבירים את 55 הגרמים הנוספים של החלבון לקערת מיקסר עם בלון הקצפה.  
                                          מתחילים להרתיח את המים והסוכר תוך כדי ערבוב. כדאי לעבוד עם מברשת סיליקון ולהקפיד לערבב כל העת גם את הסירופ הנוגע בדפנות הסיר, כדי שלא יתקרמל מהר מדי. הסירופ צריך להשאר צלול. ממשיכים להרתיח מספר דקות עד להגעה ל 110 מעלות. בשלב זה מפעילים את המיקסר במהירות בינונית. ממשיכים להרתיח את הסירופ עד להגעה ל 118 מעלות. יוצקים את הסירופ בזרם דק על החלבונים המוקצפים (לא על דופן קערת המיקסר), תוך כדי הקצפה במהירות בינונית. מגבירים למהירות המירבית וממשיכים להקציף מספר דקות עד שדפנות הקערה קרות למגע והמרנג יציב מאד. לקראת סוף ההקצפה מוסיפים את צבע המאכל הרצוי (לצבע סופגני – מוסיפים שילוב של חום וכתום).
                                         
                                          מערבבים: זהו החלק הטריקי ביותר. מוסיפים את המרנג לתערובת השקדים, ב2-3 פעמים ומערבבים במרץ באמצעות מרית נוקשה. כמה מערבבים? שאלת מליון הדולר. העיסה צריכה להיות מעט נוזלית, אבל לא מדי. כל ערבוב יתר/תת ערבוב ישפיעו על התוצאה הסופית. ברב המתכונים קורים לזה "מרקם לבה". בחיי הקצרים טרם נתקלתי בלבה בגודל טבעי, אבל אם בכל זאת אנסה להגדיר.. מדובר על מרקם טחינה ממש ממש סמיכה וגרגירית, שנופלת מהמרית ומתפשטת מעט (אבל ממש מעט) סביבה. בכל מקרה עדיף לערבב פחות מדי, להתחיל לזלף ולהבין שיש צורך לערבב עוד קצת.. מאשר לזלף שלוליות שמתפשטות בלי שליטה ולאבד את הסיכוי למקרון.
                                         
                                          מזליפים: מעבירים את העיסה לשק זילוף עם פייה חלקה בקוטר לא יותר מסמ' אחד. מניחים את משטח האפיה (נייר אפיה חלק או משטח סיליקון) על תבנית תנור הפוכה (כדי לקבל שטח גדול יותר לזילוף) ומזלפים עיגולים אחידים במרחק של כ 2 ס"מ אחד מהשני. מטיחים את התבנית בשיש כדי לשחרר בועות אויר קטנות. ממתינים כחצי שעה – שעה לפני אפיית המקרונים. בשלב זה יווצר קרום דק על פני המקרון שאחראי לצורתו המפורסמת. המקרון בשלב זה צריך להיות חלק למגע ובמראה מט.
                                         
                                          אופים: גם השלב הזה טומן מיכשולים בחובו. זמן אפיה של מגש מקרונים (לדעתי לא כדאי לאפות יותר ממגש אחד במקביל) נע בין 10-12 דקות, בחום של 160-170 מעלות. אני אופה בתנור מחומם ל 170 מע' 11 דקות בדיוק. איך יודעים שהמקרון מוכן? הוא תפח, פיתח "רגל" וצנח מעט בחזרה, אבל הכי חשוב – הוא כבר יציב בתחתיתו. אל תתפתו לאפות יתר על המידה, המקרונים עלולים לדהות או להיות יבשים מדי. מוציאים את המגש מהתנור ומצננים את המקרונים לחלוטין לפני שמנתקים אותם ממשטח האפיה.
                                         
                                          ממלאים: על ניר אפייה מסדרים את המקרונים בזוגות בגודל זהה. מעבירים ריבת חלב/ריבה/גנאש שוקולד לשק זילוף. מזלפים נקודה קטנה במרכז המקרון. מזלפים טבעת של שוקולד לבן סביב למילוי, וסוגרים בעזרת עוגיה נוספת. תוכלו לעטר באבקת סוכר, לזלף מעט ריבת חלב או לטבול במעט גנאש חמים ולעטר בסוכריות צבעוניות.
                                         
                                          שומרים את המקרונים במקרר יממה לפני ההגשה. לאחר מכן עדיף לאכסן במקפיא לתקופה של כשבועיים עד חודש. מקרונים ללא מילוי ניתן להקפיא לתקופה ארוכה יותר. הפשירו את המקרונים בקופסא סגורה (עדיף במקרר) כדי שלא יצברו לחות יתר בהפשרה.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/11.jpg"
    },
    {
      id: 12,
      name: "עוגת מוצרט",
      time: "שעה וחצי", 
      ingredients: [{
        title: "לשכבות מוס גנאש מוקצף",
        ingredientsList: [
          "250 גר' שוקולד לבן קצוץ",
          "200 גר' שוקולד מריר קצוץ",
          "כוס וחצי שמנת מתוקה (380 מל) – לגנאש",
          "כוס וחצי שמנת מתוקה (380 מל) – להקצפה",
          "3 גר' ג'לטין מומס ב 15 גר' מים קרים – לא חובה"
        ]
      },
      {
        title: "לשכבות מרנג ואגוזים",
        ingredientsList: [
          "4 חלבונים",
          "1/2 כוס סוכר (100 גר')",
          "3/4 כוס אבקת סוכר (100 גר')",
          "3/4 כוס אגוזי מלך טחונים (100 גר')",
          "3/4 כוס שקדים טחונים (100 גר')"
        ]
      },
      {
        title: "לשכבות גנאש שוקולד מריר",
        ingredientsList: [
          "200 גר' שוקולד מריר",
          "3/4 כוס + כף שמנת מתוקה (200 מל)"
        ]
      },
      {
        title: "לעיטור",
        ingredientsList: [
          "20 גר' שוקולד מריר",
          "שקדים או אגוזי מלך קצוצים גס"
        ]
      }],
      description: `אופן ההכנה:
                                              מכינים גנאש משני שוקולדים כבסיס למוס: מניחים שוקולד לבן קצוץ בקערה אחת, ושוקולד מריר בקערה נוספת.
                                              בסיר קטן מחממים את כמות השמנת הראשונה (380 מ"ל) לסף רתיחה.
                                              יוצקים 2/3 מהשמנת הרותחת (250 מ"ל, כוס) על השוקולד המריר, ו 1/3 (130 מ"ל, כחצי כוס) על השוקולד הלבן . במידה ותרצו לייצב יותר את מוס השוקולד הלבן, זה הזמן להוסיף לקערת השוקולד הלבן את ספוג הג'לטין המוכן.
                                              ממתינים דקה. טורפים היטב תחילה את הגנאש הלבן, ולאחר מכן את השוקולד המריר. מכסים את הקערות בניילון נצמד ומעבירים למקרר למשך שלוש שעות לפחות.
                                              בינתיים מכינים שכבות מרנג: מחממים תנור ל 110 מעלות, בחום טורבו.
                                              בקערת מיקסר מקציפים חלבונים וסוכר לקצף יציב. במהירות נמוכה מוסיפים אבקת סוכר, שקדים ואגוזים טחונים ומערבלים לקבלת תערובת אחידה.
                                              על מגש מרופד בניר אפיה או במשטח סיליקון מניחים את הרינג בו נשתמש להרכבת העוגה. מעבירים מעט יותר משליש מהמרנג למרכז הרינג ומשטחים בעזרת כף או פלטה מדורגת את התערובת כך שתכסה את כל שטח העיגול. מרימים את הרינג ומיישרים את המרנג בעזרת הפלטה. בסופו של דבר תיווצר לנו שכבת מרנג ישרה בגובה 1-1.5 ס"מ, ובקוטר מעט יותר מ 24 ס"מ.
                                              במגש נוסף, חוזרים על הפעולה שוב עם כשליש נוסף מהמרנג ליצירת דסקית מרנג נוספת. את שאריות המרנג משטחים בעזרת הפלטה בשטח הפנוי שנותר על ניירות האפיה. נוכל להשתמש בהם לקישוט העוגה בהמשך.
                                              אופים את המרנגים כשעתיים, עד לייבוש מלא. מצננים לטמפרטורת חדר.
                                              מכינים גנאש שוקולד מריר לשכבות העוגה: מניחים בקערה 200 גר' שוקולד מריר קצוץ . בסיר קטן מחממים 200 מ"ל שמנת לסף רתיחה. יוצקים את השמנת הרותחת על השוקולד, ממתינים דקה וטורפים היטב.
                                              מתחילים להרכיב את העוגה: מניחים את הרינג על דסקית מרנג, ובעזרת סכין חותכים בעדינות את המרנג כך שיתאים בדיוק לגודל התבנית. חוזרים על הפעולה שוב עם דסקית המרנג הנוספת. משאירים אותה בתוך הרינג, ועוטפים את בסיס הרינג בנייר כסף כדי למנוע זליגות. ניתן לרפד בשלב זה את דפנות הרינג בשקף אפיה להקלה על החילוץ ושמירה על מראה השכבות.
                                              יוצקים על שכבת המרנג כחצי מגנאש השוקולד החמים. את שאר הגנאש אפשר לשמור במקרר עד לציפוי.
                                              מקפיאים כ 20 דקות להתייצבות.
                                              בנתיים מכינים מוס שוקולד לבן: מעבירים את גנאש השוקולד הלבן לקערת מיקסר עם בלון הקצפה. מערבלים את הגנאש במהירות נמוכה כדי לרכך אותו מעט ולהקל על הערבוב עם כמות השמנת הנוספת.
                                              מוסיפים לו 250 מ"ל (כוס) שמנת מתוקה קרה וממשיכים לערבל במהירות נמוכה עד שהתערובת מתאחדת. רק בשלב זה מגבירים את המהירות ומקציפים היטב לקבלת מרקם מוס אוורירי.
                                              משטחים את המוס מעל שכבת הגנאש שהתייצבה, ומכסים בדסקית המרנג הנוספת בעדינות. גם אם השכבה נסדקה או נשברה מעט בהרכבה – אל דאגה, הסדק לא יורגש בסופו של דבר.
                                              מכינים מוס שוקולד מריר: מעבירים את גנאש השוקולד המריר לקערת המיקסר בה השתמשנו להקציף את מוס השוקולד הלבן. מערבלים את הגנאש במהירות נמוכה כדי לרכך אותו מעט ולהקל על הערבוב עם כמות השמנת הנוספת.
                                              מוסיפים לקערה 130 מ"ל (כחצי כוס) שמנת מתוקה קרה וממשיכים לערבל במהירות נמוכה עד שהתערובת מתאחדת לגמרי, ולא מורגשים גושי גנאש. רק בשלב זה מגבירים את המהירות ומקציפים היטב לקבלת מרקם מוס אוורירי. נזהרים מאד שלא להקציף יותר מדי, הקצפת יכולה להישבר ללא תקנה.
                                              משטחים את המוס מעל שכבת המרנג, מיישרים בעזרת פלטה, ומקפיאים לילה.
                                              מצפים את העוגה: מחממים מעט את גנאש השוקולד המריר הנותר למרקם נוזלי ויוצקים מעל העוגה הקפואה. מקפיאים לחצי שעה נוספת להתייצבות.
                                              מחלצים ומעטרים: מחלצים את העוגה מהרינג: אם השתמשתם בשקף אפיה ניתן לעשות זאת בקלות. במידה ולא – אפשר גם לחמם את דפנות הרינג בעזרת ברנר / מטלית טבולה במים רותחים, וכך להחליק את העוגה החוצה.
                                              מניחים 20 גר' שוקולד מריר בשקית אטומה ומניחים אותה בתוך כוס עם מים רותחים. ממתינים מספר דקות להמסת השוקולד. יוצרים חור קטן בקצה השקית ומזלפים פסים דקים על פני העוגה.
                                              מניחים שברי מרנג על צידי העוגה, ומצמידים שקדים גרוסים.
                                              שומרים במקפיא. מעבירים למקרר כ 4 שעות לפני ההגשה להפשרה מבוקרת.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/12.jpg"
    },
    {
      id: 13,
      name: "טארט הפוך של גבינה ושוקולד",
      time: "35 דקות", 
      ingredients: [{
        title: "לבסיס בצק פריך",
        ingredientsList: [
          "3/4 1 כוסות קמח (250 גר')",
          "2/3 כוס שקדים טחונים (70 גר')",
          "1/2 כוס + כף אבקת סוכר (70 גר')",
          "160 גר' חמאה קרה",
          "ביצה"
        ]
      },
      {
        title: "לשכבת קראנץ' נוגט",
        ingredientsList: [
          "100 גר' שוקולד מריר",
          "כוס קורנפלקס נוגט מרוסק גס (100 גר')",
          "100 גר' ממרח נוגט"
        ]
      },
      {
        title: "למוס גבינה",
        ingredientsList: [
          "1 מיכל גבינת שמנת (נפוליאון למשל)",
          "שקית סוכר וניל",
          "כוס פחות 2 כפות אבקת סוכר (100 גר')",
          "250 מל שמנת מתוקה"
        ]
      },
      {
        title: "לקרמו שוקולד",
        ingredientsList: [
          "3 גר' ג'לטין + 15 גר' מים קרים",
          "200 גר' שוקולד מריר",
          "1/2 כוס פחות כף חלב (100 גר')",
          "3/4 כוס שמנת מתוקה (175 גר')",
          "כפית קפה מגורען"
        ]
      },
      {
        title: "לעיטור",
        ingredientsList: [
          "1/2 מיכל שמנת מתוקה",
          "כף אינסטנט פודינג וניל"
        ]
      }],
      description: `אופן ההכנה:
                                                  מכינים בצק פריך: במעבד מזון מעבדים קמח, שקדים טחונים, אבקת סוכר מלח וחמאה לפירורים דקים. מוסיפים ביצה, ומעבדים לאיחוד. עוטפים בניילון נצמד ומעבירים למקרר לשעה.
                                                  מניחים רינג נמוך על גבי משטח סיליקון מחורר (מיוחד לבצק פריך) המונח על תבנית תנור.
                                                  על משטח מקומח מרדדים את הבצק לעובי כחצי ס"מ ומרפדים את הרינג בעדינות. חשוב שתחתית הבצק תהיה כמה שיותר אחידה מכיוון שזו תהיה השכבה החיצונית של העוגה בסופו של דבר.. דוקרים את הבצק בעדינות במזלג ומקפיאים לשעה. את שאריות הבצק ניתן להקפיא או להכין טארטלטים נוספים ועוגיות עגולות לקישוט העוגה.
                                                  פורשים ניר אפיה על הבצק הקפוא, וממלאים אותו בקטניות. אופים את הבצק בתנור מחומם היטב, 180 מע כ 15 דק. מסירים ניר האפייה והמשקולות ואופים להזהבה כ 5 דקות נוספות. מצננים לגמרי.
                                                  מכינים קראנץ' נוגט: מניחים קוביות שוקולד מריר בקערת זכוכית. ממיסים את השוקולד במיקרו בפולסים של 30 שניות וערבוב בין לבין.
                                                  מרסקים באופן גס קורנפלקס נוגט (כמו כריות או קראנץ נוגט). חשוב לא לרסק לפירורים דקים כדי שהשכבה תישאר פריכה. מוסיפים לשוקולד המומס את הקורנפלקס וממרח הנוגט ומערבבים לעיסה אחידה.
                                                  מעבירים את העיסה לניר אפיה, מניחים ניר אפיה נוסף מעליה ומרדדים לשכבה אחידה בגובה כחצי ס"מ. מעבירים להקפאה עד להרכבה.
                                                  מכינים מוס גבינה: מערבבים בקערה גבינת שמנת, אבקת סוכר וסוכר וניל.
                                                  בקערת מיקסר מקציפים שמנת מתוקה לקצפת יציבה, מקפלים אותה לתערובת הגבינה בעדינות. יוצקים על קלתית הבצק הקרה.
                                                  מכינים קרמו: ממיסים את הג'לטין במים קרים ומשהים כ 15 דקות לספיחת כל הנוזלים (עושים זאת ככה בדיוק).
                                                  קוצצים שוקולד מריר ומניחים בכלי ארוך וצר. מצרפים אליו את הג'לטין המוכן לעבודה (לאחר שספח את כל הנוזלים) וכפית קפה.
                                                  בסיר קטן מחממים חלב ושמנת מתוקה לסף רתיחה. יוצקים את הנוזל הרותח על השוקולד המריר. ממתינים כדקה וטוחנים בעזרת בלנדר מוט. מצננים לטמפרטורת חדר. מעבירים כ 2 כפות מהקרם לשק זילוף (שכחתם איך?) ומעבירים למקרר.
                                                  מרכיבים את העוגה: בעזרת סכין חדה, חותכים 2 מלבנים הקטנים מעט מהרינג בו אפינו את הבצק. מניחים דסקית קראנץ' אחת מעל מוס הגבינה.
                                                  יוצקים את קרמו השוקולד מעל הקראנץ', מיישרים ומניחים עליו את דסקית הקראנץ' הנוספת. מיישרים את פני הקרם יחד עם הקראנץ' כדי שכל הבצק יהיה מלא באופן אחיד ללא גלישות. מעבירים למקפיא לשעה או למקרר ללילה.
                                                  מקשטים: את העוגיות שהכנו משאריות הבצק נמלא בקרם השוקולד ששמרנו בשק הזילוף.
                                                  מקציפים שמנת עם פודינג וניל ומעבירים לשק זילוף עם צנטר משונן.
                                                  מניחים צלחת הגשה הפוכה על פני הטארט והופכים בעדינות. מקשטים את פני הטארט ההפוך בקצפת, עוגיות, קרמו שוקולד ושאריות קראנץ נוגט. אפשר גם להוסיף דפי שוקולד שבורים וכיד הדמיון הטובה.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/13.jpg"
    },
    {
      id: 14,
      name: "חטיפי טעמי ואגוזי ממכרים",
      time: "חצי שעה", 
      ingredients: [{
        title: "לבסיס קראנץ' טעמי בייגלה",
        ingredientsList: [
          "50 גר' חמאה",
          "4 כפות דבש (100 גר')",
          "3 כפות סירופ מייפל",
          "¼ כוס סוכר (50 גר')",
          "כוס פצפוצי אורז (50 גר')",
          "½ כוס בייגלה מרוסק (50 גר')",
          "4 כפות מחית נוגט (80 גר')",
          "250 גר' שוקולד חלב"
        ]
      },
      {
        title: "לבסיס נוגט אגוזי",
        ingredientsList: [
          "2 חלבונים (70 גר')",
          "קורט מלח",
          "2 כוסות סוכר (400 גר')",
          "½ כוס דבש (160 גר')",
          "¼ כוס מים (60 גר')",
          "200 גר' אגוזי לוז שלמים"
        ]
      },
      {
        title: "לטופי קרמל מלוח",
        ingredientsList: [
          "⅔ כוס שמנת מתוקה (150 גר')",
          "קורט מלח",
          "כפית תמצית וניל",
          "¾ כוס סוכר (150 גר')",
          "20 גר' חמאה"
        ]
      },
      {
        title: "לציפוי שוקולד מריר",
        ingredientsList: [
          "300 גר' שוקולד מריר",
          "50 גר' חמאת קקאו / 3 כפות שמן"
        ]
      },
      {
        title: "לציפוי שוקולד חלב",
        ingredientsList: [
          "300 גר' שוקולד חלב",
          "2 כפות שמן"
        ]
      }],
      description: `
                                                          אופן ההכנה:
מכינים בסיס קראנצ'י לטעמי : מניחים שוקולד חלב קצוץ ומחית נוגט בקערת זכוכית או נירוסטה. מניחים את הקערה על סיר קטן  עם מעט מים (נזהרים שהקערה לא תיגע במים) , מחממים על להבה בינונית ומערבבים את השוקולד להמסה. מניחים בצד.  בסיר קטן מרתיחים חמאה, דבש, סירופ מייפל וסוכר , ומבשלים עוד 5 דקות. מוסיפים פצפוצי אורז ובייגלה מרוסק ומערבבים לאיחוד. מוסיפים את השוקולד המומס עם הנוגט ומערבבים לאיחוד.
מעבירים את התערובת לשק זילוף, גוזרים פתח גדול יחסית (לאפשר מעבר מרווח של גושי הבייגלה והפצפוצים) ומזלפים לתבניות סיליקון בצורות קטנות, נזהרים לא למלא את השקעים עד הסוף ולהשאיר מקום לקרמל. אני השתמשתי בתבנית עם 40 שקעים בגודל 5*2 ס"מ כל שקע. מעבירים למקפיא לשעה.
מכינים בסיס נוגט לאגוזי: בקערת מיקסר מניחים חלבונים וקורט מלח, מקציפים כדקה במהירות בינונית. במקביל מניחים סוכר בסיר קטן, יוצקים עליו באיטיות את המים וממתינים שיספגו בכל כמות הסוכר (כדי למנוע חריכה) מוסיפים דבש ומחממים תוך כדי ערבוב לקבלת סירופ זהוב בהיר.  מרתיחים וממשיכים לבשל עד שהסירופ מגיע לחום של 140 מעלות.
מפעילים את המיקסר שוב על מהירות בינונית ומזלפים את הסירופ הרותח על דופן הקערה באיטיות. ממשיכים להקציף כ 10 דקות במהירות מקסימלית עד שמתקבל קצף נוקשה, ומעט מסטיקי . מעבירים בזריזות לשק זילוף ומזלפים (אפשר עם כפפות, זה חם!) לתבניות הסיליקון בגודל הרצוי, עד לחצי מגובהן. נועצים אגוזי לוז שלמים בכל שקע. הנוגט מקבל קרום יבש לאחר מספר דקות באויר, ואז אפשר לשטח אותו מעט יותר כדי להתאים בדיוק לצורות הסיליקון. מעבירים למקפיא לכ 3 שעות.
מכינים רוטב טופי קרמל: (שימו לב – הכמות המופיעה במצרכים מתאימה לסוג אחד של חטיפים, אגוזי או טעמי. אם אתם ממש בעניין להכין את שניהם – מכפילים כמויות )  מחממים בסיר קטן שמנת מתוקה ותמצית וניל לסף רתיחה.במקביל, מחממים היטב קלחת קטנה מעל אש בינונית-גבוהה. מפזרים סוכר באופן אחיד וממתינים להמסה כמעט מלאה, ואז מוסיפים את יתרת הסוכר בהדרגה. ניתן לבחוש בכף עץ כדי לזרז את התהליך. ממתינים לקבלת קרמל אחיד. גם אם נשארו כמה גושים לא נורא, הם ימסו בהמשך או יסוננו מהרוטב הסופי.
יוצקים את השמנת החמה בזהירות לתוך הקרמל בזרם דק תוך ערבוב מתמיד בכף העץ. הרוטב מבעבע מאד, אך הוא מתאחד ומסמיך תוך כדי הבישול. מוסיפים מלח וממשיכים לבשל כמה דקות לקבלת רוטב אחיד וסמיך בצבע ענברי משגע. אם עדיין נתקלתם בשאריות סוכר קטנות – מסננים את הרוטב במסננת דקה. מסירים מהאש ומוסיפים קוביות חמאה, מערבבים להמסה.
מעבירים את הקרמל לשק זילוף ומצננים מעט. אם רוצים קרמל חלק – משתמשים בו בעודו חמים ויוצקים שכבה דקה מעל החטיפים. אפשר גם לצנן אותו לחלוטין בטמפרטורת חדר, ואז לזלף אותו בצורת זיג – זג כמו שזילפתי על חטיפי האגוזי. מחזירים את החטיפים להקפאה של שעה נוספת.
מצפים בשוקולד מריר או חלב: בשימוש בחמאת קקאו – ממיסים אותה בנפרד במיקרוגל במספר פולסים עד שהיא נמסה לחלוטין. במקביל ממיסים שוקולד על בין מארי (כמו בשלב 1) מוסיפים לו את חמאת הקקאו המומסת או השמן ומערבבים היטב לאיחוד.בעזרת מזלג טובלים את החטיפים בשוקולד, מנערים מעט להסרת עודפים, וומניחים על נייר אפיה או משטח סיליקון להתגבשות.
מעבירים למקפיא ל 20 דקות להתייצבות מלאה, ומנתקים בזהירות מהניר / סיליקון. שומרים בקפסא אטומה במקרר, או במקפיא לטווח ארוך..`,
      category: "עוגות",
      favorite: false,
      img: "/Images/14.jpg"
    },
    {
      id: 15,
      name: "פאי פקאן",
      time: "25 דקות",
      ingredients: [{
        title: "לבצק פריך",
        ingredientsList: [
          "2 כוסות קמח (280 גר')",
          "1/2 כוס גר' סוכר (100 גר')",
          "200 גר' חמאה קרה",
          "קורט מלח",
          "ביצה"
        ]
      },
      {
        title: "למלית פקאן",
        ingredientsList: [
          "75 גר' חמאה",
          "1/3 כוס שמנת מתוקה (80 מל)",
          "3 כפות סילאן",
          "1 כוס סוכר (200 גר')",
          "קורט מלח",
          "30 גר' שוקולד מריר",
          "2 ביצים",
          "2 כוסות פקאן טבעי קצוץ גס (200 גר')",
          "כוס פקאן טבעי שלם לקישוט (100 גר')"
        ]
      }],
      description: `במעבד מזון טוחנים מעבדים קמח, חמאה סוכר ומלח לפירורים דקים.
                                                          מוסיפים ביצה ומעבדים עד לאיחוד בלבד. עוטפים בניילון נצמד ומקררים כחצי שעה.
                                                          מרדדים על משטח מקומח לעובי אחיד, מרפדים תבנית פאי / רינג נמוך ומקפיאים חצי שעה לפחות.
                                                          פורשים נייר אפיה מקומט על הבצק וממלאים בקטניות יבשות עד לקצה הבצק.
                                                          אופים בתנור מחומם 200 מעלות כרבע שעה. מסירים את המשקולות ואופים עוד 5 דק עד להזהבה.
                                                          מכינים את המלית: מחממים בסיר קטן שמנת מתוקה, סילאן וחמאה חתוכה לקוביות עד שהחמאה נמסה.
                                                          מכינים קרמל: מחממים היטב סיר מעל אש גבוהה. מפזרים סוכר באופן אחיד וממתינים להמסה כמעט מלאה, ואז מוסיפים את יתרת הסוכר בהדרגה. ניתן לבחוש בכף עץ או מרית סיליקון כדי לזרז את התהליך. ממתינים לקבלת קרמל אחיד.
                                                          יוצקים את השמנת החמה בזהירות לתוך הקרמל בזרם דק תוך ערבוב מתמיד. מוסיפים מלח וממשיכים לבשל כמה דקות לקבלת רוטב אחיד וסמיך.
                                                          מסירים מהאש, מוסיפים שוקולד מריר, מערבבים להמסה, וממתינים שהתערובת תצטנן (חשוב!). מוסיפים את האגוזים הקצוצים ואת הביצים ומערבבים היטב.
                                                          יוצקים את המלית על הקלתית האפויה ומסדרים את שאריות הפקאנים השלמים מעל המלית. אופים כ 20 דק' עד שהמלית מבעבעת ומתייצבת.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/15.jpg"
    },

    {
      id: 16,
      name: "חיתוכיות למון ליים",
      time: "20 דקות",
      ingredients: [{
        title: "לבסיס פריך",
        ingredientsList: [
          "200 גר' מרגרינה / חמאה רכה",
          "½ כוס אבקת סוכר (80 גר')",
          "2 כוסות קמח (280 גר')",
          "קורט מלח"
        ]
      },
      {
        title: "למלית למון ליים",
        ingredientsList: [
          "4 ביצים",
          "½ כוס מיץ לימון סחוט (120 מל)",
          "¼ כוס מיץ ליים סחוט (60 מל)",
          "½ 1 כוסות סוכר (300 גר')",
          "¼ כוס קמח (35 גר')"
        ]
      },
      {
        title: "לעיטור",
        ingredientsList: [
          "50 גר' אבקת סוכר"
        ]
      }],
      description: `מכינים בצק פריך: מערבלים מרגרינה במיקסר עם וו גיטרה במהירות גבוהה עד לקבלת תערובת קרמית תפוחה וחלקה.
                                                              מוסיפים אבקת סוכר וממשיכים לערבל לאיחוד במהירות נמוכה, מוסיפים קמח ומלח וערבלים עד לקבלת גושי בצק גדולים.
                                                              מניחים ניר אפיה על התבנית ומשטחים עליו את הבצק בעזרת הידיים. אופים בתנור מחומם ל 180 מעלות כ 15-20 דקות, להזהבה.
                                                              מכינים את מלית הלימון: טורפים בקערה – מיץ לימון / ליים, סוכר, ביצים וקמח לקבלת תערובת נוזלית.
                                                              יוצקים את התערובת על פני הבצק האפוי ומחזירים לאפיה נוספת של כ 35 דקות , עד שהמלית מתייצבת ומתחילה להזהיב.
                                                              מצננים את העוגה. לפני החיתוך מומלץ להקפיא את העוגה לחצי שעה לפחות, לחלץ את ניר האפיה עם העוגה שעליו, ולחתוך בעזרת סכין חדה לחתיכות שוות.
                                                              לפני ההגשה – מפזרים אבקת סוכר על החיתוכיות.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/16.jpg"
    },
    {
      id: 17,
      name: "חטיפי גרנולה בטעמים",
      time: "45 דקות",
      ingredients: [{
        title: "חומרים יבשים",
        ingredientsList: [
          "2 כוסות שיבולת שועל שלימה (250 גר)",
          "1/2 כוס סוכר חום / דמררה (100 גר')",
          "1/3 כוס קמח (מלא) (50 גר')",
          "1/2 כפית מלח",
          "1 כוס אגוזים / שקדים / בוטנים קצוצים גס",
          "3/4 כוס שוקולד קצוץ / חמוציות"
        ]
      },
      {
        title: "חומרים נוזליים",
        ingredientsList: [
          "1/3 כוס טחינה גולמית / חמאת בוטנים (85 גר')",
          "1/4 כוס דבש / סילאן (70 גר')",
          "1/3 כוס שמן (70 גר')",
          "כף מים"
        ]
      },
      {
        title: "לציפוי (לא חובה)",
        ingredientsList: [
          "100 גר' שוקולד צ'יפס"
        ]
      }],
      description: `בקערה אחת מערבבים את כל החומרים היבשים: שיבולת שועל, סוכר, קמח, מלח אגוזים ותוספות.
                                                                  בקערית נפרדת מערבבים את שאר החומרים: טחינה / חמאת בוטנים, דבש / סילאן, שמן ומים.
                                                                  יוצקים את התערובת הנוזלית לקערת היבשים ומערבבים היטב לאיחוד.
                                                                  משטחים את התערובת על תבנית תנור מרופדת בניר אפיה. הגובה תלוי בכם: תרצו חטיף עבה יחסית? שטחו לגובה של כס"מ אחד. דק ופריך יותר לנגיסה? שטחו מעט יותר. רק שימו לב שזמני האפיה משתנים בהתאם לכך.
                                                                  אני משטחת בד"כ בתוך רינג 25*25 כך שמתקבלים חטיפים שמנמנים וטעימים שיש בהם מקום להרבה דברים טובים.
                                                                  אופים בתנור מחומם ל 180 מעלות כ 15-30 דקות, עד לרמת ההזהבה הרצויה. זה בהחלט משתנה מתנור לתנור ותלוי בעובי התערובת.
                                                                  אופציה לשדרוג: מיד כשמוציאים את התבנית מהתנור מפזרים על הגרנולה שוקולד צ'יפס בנדיבות. ממתינים כדקה כדי שהשוקולד ימס מחום התבנית, ומשטחים בעזרת סכין או פלטה לשכבה אחידה מעל הגרנולה.
                                                                  ממתינים לקירור מלא של הגרנולה (חשוב! אחרת תקבלו פירורים ולא חטיפים) וחותכים למלבנים / ריבועים בעזרת סכין חדה.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/17.jpg"
    },
    {
      id: 18,
      name: "סטיקי באנז קרמל פקאן",
      time: "שעה וחצי",
      ingredients: [{
        title: "לבצק שמרים",
        ingredientsList: [
          "1 קג קמח (7 כוסות + כף)",
          "2 כפות שמרים יבשים",
          "3 ביצים",
          "3/4 כוס סוכר (150 גר')",
          "כוס שמן (240 מל)",
          "350 מל מים (כוס וחצי)",
          "כפית שטוחה מלח"
        ]
      },
      {
        title: "לקרמל",
        ingredientsList: [
          "150 גר' חמאה",
          "1/2 כוס סוכר חום כהה או דמררה (100 גר')",
          "כפית מלח",
          "1/4 כוס סירופ מייפל",
          "1/4 כוס דבש",
          "200 גר' אגוזי פקאן טבעיים, קצוצים גס"
        ]
      },
      {
        title: "למלית",
        ingredientsList: [
          "100 גר' חמאה",
          "1/2 כוס סוכר חום או דמררה (100 גר')",
          "4 כפות קינמון",
          "כפית מלח"
        ]
      },
      {
        title: "לסירופ",
        ingredientsList: [
          "1/2 כוס סוכר (100 גר')",
          "1/2 כוס מים (120 מל)"
        ]
      }],
      description: `אופן ההכנה:
                                                                          מכינים את הבצק: בקערת מיקסר עם וו לישה מניחים את החומרים לפי הסדר: קמח,שמרים, ביצים, סוכר, 3/4 כוס שמן ,מים ומלח. מתחילים ללוש את הבצק במהירות נמוכה, ותוך כדי הלישה מוסיפים את רבע כוס השמן הנוספת. ממשיכים ללוש 10 דקות עד שמתקבל בצק נעים ולא דביק במיוחד.
                                                                          עוטפים את הקערה בשקית נילון ומעבירים לתפיחה לילה במקרר, או כשעתיים בטמפ' חדר עד שהוא מכפיל את נפחו.
                                                                          מכינים את הקרמל: בסיר קטן מניחים חמאה, סוכר, מייפל דבש ומלח, ומביאים לרתיחה. מבשלים עוד מספר דקות להסמכה. יוצקים מחצית מהקרמל בתחתית כל תבנית (שימו לב שמדובר על תבנית לא מתפרקת! כדי למנוע דליפות קרמל בזמן האפיה..) מפזרים את שברי הפקאנים על הקרמל.
                                                                          מכינים מלית: בסיר קטן (אפשר גם בזה שהכנו את הקרמל, וגם אין צורך לשטוף אותו לפני..) ממיסים חמאה. בקערה קטנה נוספת מערבבים סוכר, קינמון ומלח.
                                                                          ממלאים את הבצק ואופים: מחלקים את הבצק לשני חלקים. מרדדים כל חלק למלבן גדול ומושחים אותו בחמאה בעזרת מברשת או מרית. מפזרים שכבה אחידה של תערובת הסוכר והקינמון. מגלגלים את הבצק לרולדה, פורסים אותה ל 12 פרוסות שושנים שוות. מסדרים את השושנים על שכבת הקרמל בצורה מרווחת וחוזרים על התהליך עם חלקו השני של הבצק בתבנית הנוספת.
                                                                          כדי לשמור על גובה אחיד של השושנים אני חותכת את הרולדה לחצי, כל חצי חוצה שוב לרבע, ואז כל רבע ל 3 פרוסות שוות. כך קל יותר לראות את עובי הפרוסה ולשמור על אחידות.
                                                                          מתפיחים את השושנים כחצי שעה, ואופים את העוגות כ 40 דקות בתנור מחומם ל 180 מע' עד להזהבה.
                                                                          בזמן האפייה מכינים סירופ סוכר- מרתיחים סוכר ומים בסיר קטן (הפעם כדאי שיהיה נקי..) מבשלים 5 דקות נוספות ומצננים. כשהעוגות מוכנות ויצאו מהתנור – מורחים עליהן את הסירופ בעזרת מברשת. הסירופ עוזר בשמירה על הטריות והלחות בעוגה ולכן לא כדאי לוותר עליו.
                                                                          `,
      category: "עוגות",
      favorite: false,
      img: "/Images/18.jpg"
    },
    {
      id: 19,
      name: "עוגת גבינה פירורים ושוקולד לבן",
      time: "40 דקות",
      ingredients: [{
        title: "לפירורים",
        ingredientsList: [
          "200 גר' חמאה",
          "4 כפות סוכר (40 גר')",
          "1 סוכר וניל (10 גר')",
          "1 אבקת אפיה (10 גר')",
          "½ 2 כוסות קמח (350 גר')",
          "1 ביצה (או 2 חלמונים)",
          "חופן אגוזי לוז קלויים וקלופים",
          "100 גר' שוקולד לבן"
        ]
      },
      {
        title: "לקרם גבינה",
        ingredientsList: [
          "200 גר' שוקולד לבן",
          "¼ כוס חלב (60 גר')",
          "500 גר' גבינת שמנת",
          "100 גר' גבינה 5%",
          "גביע שמנת חמוצה (200 מל)",
          "¾ כוס סוכר (150 גר')",
          "2 שקיות סוכר וניל",
          "מיכל שמנת מתוקה (250 מל)",
          "3 גר' גלטין + 15 גר' מים קרים – לא חובה"
        ]
      }],
      description: `מכינים את הפירורים: במעבד מזון טוחנים לבצק פירורי חמאה, סוכר, אבקת אפיה, סוכר וניל, קמח וביצה.
                                                                      משטחים את הפירורים על תבנית תנור מרופדת בנייר אפיה, ואופים בתנור מחומם ל-180 מעלות כ-15 דקות להזהבה. מדי פעם מערבבים את הפירורים כדי שלא ישרפו. מצננים היטב.
                                                                      מניחים במעבד מזון אגוזים ושוקולד לבן וטוחנים לפירורים. מוסיפים לפירורים, מערבבים היטב ושומרים בצד להרכבת העוגה.
                                                                      מכינים קרם גבינה: מכינים ג'לטין – (לא חובה) – בקערה קטנה משרים אבקת ג'לטין במים קרים ומשאירים כ-10 דקות לספיגת הנוזלים.
                                                                      בסיר קטן ממיסים שוקולד לבן קצוץ וחלב, על להבה נמוכה תוך כדי ערבוב (זהירות על השוקולד.. שלא ישרף!). שומרים בצד.
                                                                      בקערת המיקסר מניחים גבינות, שמנת חמוצה, סוכר וסוכר וניל ומתחילים להקציף במהירות נמוכה. מוסיפים שמנת מתוקה וממשיכים להקציף במהירות גבוהה כ-5 דקות. מוסיפים את תערובת השוקולד הלבן במהירות נמוכה עד לאיחוד.
                                                                      במידה ותרצו להוסיף ג'לטין – כך עושים: ממיסים אותו במיקרו כ-20 שניות עד שהוא הופך לנוזל צלול (זהירות מחימום יתר!), מוסיפים כמה כפות מקרם הגבינה לג'לטין המומס ומערבבים היטב, ולאחר מכן מוסיפים את הג'לטין המדולל בקרם הגבינה לתערובת הגבינה כולה. מערבבים לאיחוד.
                                                                      מרכיבים את המנה בכלי הרצוי: תבנית, כוסות אישיות, או רינגים. אם אתם משתמשים ברינג – גדול או מנות אישיות – רפדו את הדפנות בשקף שיקל על החילוץ. מפזרים מחצית מכמות הפירורים על בסיס התבנית, מהדקים היטב. יוצקים את כל קרם הגבינה, ומפזרים את כמות הפירורים הנותרת. מתאימים את כמות הפירורים לכלי שלכם כך שתיווצר שכבה שווה של פירורים מעל ומתחת לקרם הגבינה.
                                                                      מעבירים את העוגה למקרר למספר שעות להתייצבות.
                                                                      העוגה מעולה בהקפאה. מעבירים למקרר מספר שעות לפני ההגשה להפשרה מבוקרת.`,
      category: "עוגות",
      favorite: false,
      img: "/Images/19.jpg"
    },
    {
      id: 20,
      name: "טארט בוטנים ושוקולד ללא אפיה",
      time: "חצי שעה",
      ingredients: [{
        title: "לבסיס",
        ingredientsList: [
          "שרוול עוגיות פתי בר (250 גר')",
          "5 כפות גדושות חמאת בוטנים"
        ]
      },
      {
        title: "למלית",
        ingredientsList: [
          "200 גר' בוטנים אמריקאיים (ציפוי דק)",
          "150 גר' שוקולד מריר",
          "1 מיכל שמנת מתוקה (240 מל)",
          "2 כפות סוכר (20 גר')",
          "1 מיכל גבינת שמנת (240 גר')",
          "1/2 כוס חמאת בוטנים",
          "1/2 כוס אבקת סוכר (100 גר')"
        ]
      },
      {
        title: "לציפוי גנאש",
        ingredientsList: [
          "120 גר' שוקולד מריר קצוץ",
          "1/2 כוס שמנת מתוקה (120 גר')",
          "3 כפות חמאת בוטנים"
        ]
      }],
      description: `
                                                                                אופן ההכנה:
                                                                                מכינים בסיס: במעבד מזון טוחנים את העוגיות לקבלת פירורים דקים. מוסיפים חמאת בוטנים ומעבדים שוב לקבלת פירורים לחים, שבהידוק קל נדבקים אחד לשני- התערובת מוכנה. אם לא- מוסיפים עוד מעט חמאת בוטנים.
                                                                                מהדקים את הפירורים לתבנית פאי מתפרקת בגודל שברשותכם. מעבירים למקפיא עד לסיום הכנת המלית.
                                                                                מכינים בוטנים מצופים: ממיסים שוקולד מריר בקערה המיועדת למיקרוגל, בפולסים של 30 שניות. מערבבים בין הפולסים לקבלת שוקולד מריר מומס וחלק. שופכים את כל הבוטנים האמריקאיים לקערת השוקולד ומערבבים היטב עד שכולם מצופים מכל הכיוונים. בעזרת כפית או מזלג מוציאים את הבוטנים המצופים אחד אחד ומניחים על ניר אפיה. בימי החורף אפשר להשאיר את הבוטנים המצופים בטמפרטורת חדר, השוקולד יתקשה תוך מספר דקות. בימים חמים מומלץ להעביר להתקשות במקרר.
                                                                                מכינים מלית גבינה וחמאת בוטנים: בקערת מיקסר מקציפים שמנת מתוקה וסוכר. בקערת מיקסר נוספת מערבלים גבינת שמנת, חמאת בוטנים ואבקת סוכר לקבלת תערובת אחידה. מוסיפים בהדרגה את השמנת המוקצפת לתערובת הגבינה.
                                                                                מרכיבים את הטארט: מניחים שכבה של בוטנים מצופים על בסיס הפירורים הקפוא. יוצקים את מלית הגבינה, ומסיימים בעוד בוטנים מצופים. מחזירים להקפאה של כשעה להתייצבות מוחלטת לפני הציפוי.
                                                                                מכינים ציפוי גנאש: בסיר קטן מחממים שמנת מתוקה לסף רתיחה. מוסיפים שוקולד מריר קצוץ. ממתינים כדקה וטורפים לקבלת גנאש חלק. במקביל מעבירים את החמאת בוטנים לשק זילוף (או אפילו לשקית אוכל) מניחים בתוך כוס מים חמים מספר דקות כדי שחמאת הבוטנים תהיה נוזלית יותר.
                                                                                מצפים ומקשטים: מוציאים את הטארטים מהמקפיא ובזריזות יוצקים למרכז הטארט את הגנאש החמים. מטלטלים את התבנית כך שהגנאש מצפה את המלית במידה שתרצו. מזלפים פסים עדינים של חמאת בוטנים ומקשקשים בעזרת קיסם בדוגמא הרצויה: מזלפים נקודות חמאת בוטנים בהיקף הטארט, ומעבירים את הקיסם בין הנקודות ליצירת שביל לבבות. אפשרות נוספת – מזלפים פסי אורך של חמאת בוטנים ומציירים בעזרת הקיסם פסי רוחב. אפשר גם סתם לשייש את חמאת הבוטנים בצורה לא סימטרית. מעטרים בפירורי בוטנים אמריקאיים מצופים.
                                                                                חשוב להזדרז עם הקישוט מכיוון שהוא מתקשה במהירות על מלית הגבינה הקפואה. מעטרים בשאריות בוטנים מצופים. מקפיאים לפני חילוץ הטארט מהתבנית, כדי למנוע התפרקות של הבסיס הפירורי.
                                                                                שומרים בקירור עד להגשה  – אם היא מתוכננת ליממה הקרובה. לטווח ארוך יותר עדיף לשמור במקפיא ולהפשיר מספר שעות במקרר לפני ההגשה.
                                                                              `,
      category: "עוגות",
      favorite: false,
      img: "/Images/20.jpg"
    },
    {
      id: 21,
      name: "קראק פאי",
      time: "40 דקות",
      ingredients: [
        {
          title: "לקלתית עוגית שיבולת שועל",
          ingredientsList: [
            "150 גר' חמאה קרה",
            "¼ כוס סוכר דמררה (50 גר')",
            "¼ כוס סוכר (50 גר')",
            "כוס קמח (140 גר')",
            "¼ כפית אבקת אפיה",
            "¼ כפית סודה לשתיה",
            "¼ כפית מלח",
            "2 ביצים",
            "½ 1 כוסות שיבולת שועל שלימה (150 גר')",
            "50 גר' חמאה רכה"
          ]
        },
        {
          title: "למלית",
          ingredientsList: [
            "200 גר' חמאה",
            "כוס סוכר (200 גר')",
            "½ כוס סוכר דמררה (100 גר')",
            "3 כפות אבקת חלב (30 גר') – חובה!",
            "¼ כפית מלח",
            "כפית תמצית וניל",
            "מיכל שמנת מתוקה (240 מל)",
            "7 חלמונים"
          ]
        }
      ],
      description: `
                    מכינים עוגית שיבולת שועל: במעבד מזון מניחים את החמאה הקרה עם כל החומרים היבשים: סוכר, סוכר דמררה, קמח, אבקת אפיה, סודה לשתיה ומלח. מעבדים לקבלת פירורים. מוסיפים ביצים ומעבדים לקבלת בצק דביק. מוסיפים שיבולת שועל ומאחדים אותה לתערובת במספר פולסים (זהירות! לא לטחון יותר מדי).
                    משטחים את התערובת על תבנית תנור מרופדת בנייר אפיה, לגובה כחצי ס"מ. אופים בתנור מחומם ל 180 מעלות כ 20-25 דקות עד שהעוגיה מזהיבה לגמרי. שוברים את העוגיה לשברים גדולים – אם היא עדיין רכה במרכזה ממשיכים לאפות עוד 5 דקות לייבוש מלא. מצננים לגמרי.
                    מעבירים את שברי העוגיה למעבד מזון וטוחנים יחד עם 50 גר' חמאה רכה לקבלת פירורים לחים.
                    מרפדים את תבניות הפאי בתערובת הפירורים ומהדקים היטב, מעבירים למקפיא ל 15 דקות. אופים בתנור מחומם ל 180 מעלות, 10 דקות.
                    בינתיים מכינים את המלית: ממיסים חמאה ומצננים מעט. מניחים במעבד מזון סוכרים, אבקת חלב ומלח ומתחילים לערבל. מזלפים פנימה את החמאה המומסת, לאחר מכן מוסיפים שמנת מתוקה ותמצית וניל, ולבסוף מוסיפים את החלמונים. מעבדים כדקה לאיחוד כך שמתקבלת תערובת בהירה, קרמית וחלקה מאוד.
                    יוצקים את המלית על הקלתיות האפויות. אופים 15 דקות בחום של 180 מעלות, מנמיכים לחום של 160 מעלות ואופים 10-15 דקות נוספות. המלית צריכה להיות מעט רוטטת במרכזה.
                    מצננים ושומרים במקרר עד להגשה. לפני ההגשה מחלצים את הפאי מהתבניות, ומפדרים באבקת סוכר.
                    `,
      category: "חלבי",
      favorite: false,
      img: "/Images/21.jpg"
    }
    
    ,{
      id: 22,
      name: "עוגת חטיף שוקולד- חמאת בוטנים",
      time: "שעה",
      ingredients: [
        {
          title: "לעוגת שוקולד",
          ingredientsList: [
            "200 גר' מרגרינה / חמאה רכה או כוס שמן",
            "כוס סוכר (200 גר')",
            "4 ביצים",
            "6 כפות קקאו (60 גר')",
            "כפית תמצית וניל",
            "כוס קמח (140 גר')",
            "כפית אבקת אפיה",
          ],
        },
        {
          title: "לציפוי",
          ingredientsList: [
            "200 גר' ממרח חלבה",
            "100 גר' שוקולד מריר",
            "כוס חמאת בוטנים (250 גר')",
            "4 כוסות פצפוצי אורז (170 גר')",
          ],
        },
      ],
      description: `
                מחממים תנור ל-180 מעלות.
                מכינים את עוגת השוקולד: במיקסר עם וו גיטרה מערבלים חמאה וסוכר לקבלת קרם חלק. 
                אם מחליפים בשמן – אפשר לערבב אותו עם הסוכר במטרפה ללא צורך במיקסר.
                מוסיפים לתערובת את שאר הרכיבים: ביצים, קקאו, תמצית וניל, קמח ואבקת אפיה. מערבלים לאיחוד.
                משטחים את התערובת בתבנית, ואופים כ-20-25 דקות להתייצבות. מצננים מעט.
                
                מצפים את העוגה: מורחים את ממרח החלבה על פני העוגה האפויה כדי שידביק היטב את השכבה הבאה.
                מכינים חטיף פצפוצי אורז: ממיסים במיקרוגל חמאת בוטנים עם שוקולד מריר, מערבבים לאיחוד.
                מוסיפים את פצפוצי האורז ומערבבים היטב. מניחים על שכבת ממרח החלבה ומהדקים היטב.
                
                אם תרצו לחתוך את העוגה לפני ההגשה – מומלץ להקפיא אותה לזמן קצר (חצי שעה עד שעה) ולחתוך עם סכין טובה. 
                הקוביות יצאו יפות ומדוייקות.
            `,
      category: "חלבי",
      favorite: false,
      img: "/Images/22.jpg",
    },
    {
      id: 23,
      name: "ממתק שוקולד וחמאת בוטנים",
      time: "חצי שעה",
      ingredients: [
        {
          title: "לשכבות השוקולד",
          ingredientsList: [
            "300 גר' שוקולד מריר",
            "65 גר' חמאת בוטנים חלקה (2 כפות גדושות)",
          ],
        },
        {
          title: "לשכבת חמאת הבוטנים",
          ingredientsList: [
            "200 גר' חמאת בוטנים חלקה (4 כפות גדושות מאד)",
            "100 גר' חמאה / מחמאה",
            "1/2 כוס פצפוצי אורז",
            "1/2 כוס בוטנים קצוצים / שקדים פרוסים (65 גר)",
            "100 גר אבקת סוכר",
          ],
        },
      ],
      description: `
                לשכבת השוקולד: בסיר קטן או בקערה חסינת חום במיקרוגל, ממיסים שוקולד וחמאת בוטנים לקרם חלק.
                אם משתמשים ברינג – עוטפים את תחתית הרינג בנייר כסף ומהדקים אותו היטב לדפנות. מניחים אותו על תחתית אלומיניום מתאימה.
                מעבירים חצי מהתערובת לרינג / תבנית ח"פ. מטלטלים את הרינג / תבנית עד ששכבת השוקולד מכסה את כל התחתית.
                מעבירים להקפאה ל-10 דקות.
                
                לשכבת חמאת הבוטנים: בסיר קטן או בקערה חסינת חום במיקרוגל, ממיסים חמאת בוטנים וחמאה / מחמאה.
                מוסיפים פצפוצי אורז, בוטנים קצוצים ואבקת סוכר ומערבבים היטב.
                מוציאים את התבנית עם שכבת השוקולד מהמקפיא, ומשטחים מעליה את תערובת חמאת הבוטנים. מיישרים בעזרת כף, אך עדיף בעזרת פלטה מדורגת (מה זה? חפשו בכדאי לדעת – איזה כלים לקנות).
                מעבירים להקפאה ל-15 דקות.
                
                מחממים מעט את המחצית השנייה של תערובת השוקולד, ויוצקים מעל לשכבת חמאת הבוטנים. מטלטלים את התבנית כך שהשוקולד יכסה את כל שכבת חמאת הבוטנים. כדאי להזדרז כי השוקולד מתקשה במהירות.
                מקפיאים לחצי שעה נוספת.
                
                בעזרת סכין טובה, חותכים לריבועים או מלבנים קטנים.
            `,
      category: "פרווה",
      favorite: false,
      img: "/Images/23.jpg",
    },
    {
      id: 24,
      name: "מנדיאנט – דסקיות שוקולד ואגוזים מקורמלים",
      time: "20 דקות",
      ingredients: [
        {
          title: "לדסקיות שוקולד",
          ingredientsList: [
            "300 גר' שוקולד מריר",
            "100 גר' שוקולד לבן",
          ],
        },
        {
          title: "לאגוזים מקורמלים",
          ingredientsList: [
            "כוס תערובת אגוזים: מלך, לוז, פקאן",
            "2 כפות סילאן",
            "2 כפות שמן",
            "קורט מלח"
          ]
        }],
      description: `
                מקרמלים אגוזים: מניחים את כל סוגי האגוזים על תבנית תנור מרופדת בנייר אפייה, יוצקים עליהם סילאן, שמן ומלח ומערבבים.
                אופים בתנור מחומם ל-180 מעלות כ-25 דקות, מערבבים את האגוזים מדי פעם ונזהרים שלא ישרפו. מצננים היטב.
                
                מכינים דסקיות שוקולד משוייש: ממיסים קוביות שוקולד מריר במיקרוגל, בפולסים של 30 שניות תוך כדי ערבוב ביניהם, או בכלי חסין אש מעל סיר מים רותחים. מעבירים לשק זילוף. במקביל ממיסים גם את השוקולד הלבן באותו אופן, ומעבירים לשק זילוף נוסף.
                
                על תבנית תנור מרופדת בנייר אפייה מזלפים שלוליות נחמדות של שוקולד מריר, ובתוכן מזלפים ספירלה של שוקולד לבן. משיישים בעדינות בעזרת קיסם או שיפוד.
                
                מניחים אגוזים במרכז השלוליות, ומעבירים למקרר לחצי שעה.
                
                מפרידים מנייר האפייה בזהירות ושומרים בקירור.
            `,
      category: "פרווה",
      favorite: false,
      img: "/Images/24.jpg",
    },
    {
      id: 25,
      name: "כדורי פררו רושה ביתיים",
      time: "שעה ורבע",
      ingredients: [
        {
          title: "לכדורי פררו",
          ingredientsList: [
            "100 גר' גליליות או שבבי ופל",
            "150 גר' אגוזי לוז קלויים וקלופים",
            "150 גר' מחית נוגט (כחצי כוס)",
            "100 גר' שוקולד מריר",
          ],
        },
        {
          title: "לציפוי שוקולד",
          ingredientsList: [
            "200 גר' שוקולד מריר",
            "2 כפות שמן",
          ],
        },
      ],
      description: `
                מכינים את העיסה: במעבד מזון טוחנים 100 גר' אגוזי לוז וגליליות או שבבי ופל לפירורים דקים. מוסיפים מחית נוגט וממשיכים לעבד עד לאיחוד.
                ממיסים 100 גר' שוקולד מריר במיקרו ומוסיפים לתערובת.
                מצננים את התערובת כחצי שעה במקרר או עד שהיא נוחה לעבודה ולא נוזלית מדי.
                
                בידיים רטובות מעט יוצרים כדורים קטנים מהתערובת ומחדירים במרכז כל כדור אגוז לוז שלם, או חצי אגוז לוז ליצירת כדורים קטנים יותר. מקפיאים את הכדורים כשעה.
                
                מצפים בשוקולד: בקערת זכוכית ממיסים שוקולד מריר במיקרו בפולסים של 30 שניות וערבוב בין לבין.
                טובלים את הכדורים הקפואים בזריזות בשוקולד המריר, מנערים מעודפי שוקולד ומניחים על רשת עד להתקשות השוקולד. כדאי לעבוד בנגלות קטנות של 10 כדורים כל פעם כדי שהכדורים לא יפשירו תוך כדי הציפוי.
                
                ציפוי הכדורים בשוקולד יכול להיעשות בעזרת לקקן רך – מניחים את הכדור על הלקקן ומגלגלים אותו בתוך השוקולד המומס , או בעזרת מזלג – מניחים את הכדור על המזלג, טובלים את כולו בשוקולד, מוציאים ומנערים עודפים.
                
                שומרים את הכדורים במקפיא, לפני ההגשה מפשירים מעט.
            `,
      category: "פרווה",
      favorite: false,
      img: "/Images/25.jpg",
    },
    {
      id: 26,
      name: "חטיפי טים טאם",
      time: "שעה",
      ingredients: [
        {
          title: "לבצק פריך קקאו",
          ingredientsList: [
            "150 גר' חמאה / מרגרינה בטמפ' חדר",
            "100 גר' אבקת סוכר (כוס פחות 2 כפות)",
            "1 ביצה",
            "קורט מלח",
            "3 כפות שקדים טחונים (30 גר')",
            "1/2 1 כוסות + כף קמח (225 גר')",
            "1/2 2 כפות קקאו",
            "1/2 כפית אבקת אפיה",
            "כף חלב במידת הצורך",
          ],
        },
        {
          title: "למילוי גנאש שוקולד לבן ופקאן",
          ingredientsList: [
            "1/3 כוס שמנת מתוקה (80 מ",
            "כפית דבש (10 גר')",
            "165 גר' שוקולד לבן קצוץ",
            "20 גר' פקאן סיני (חופן קטן)",
            "25 גר' חמאה רכה",
          ],
        },
        {
          title: "לציפוי שוקולד",
          ingredientsList: [
            "250 גר' שוקולד חלב",
            "100 גר' שוקולד מריר",
            "4 כפות שמן צמחי (40 גר')",
            "50 גר' שוקולד מריר קצוץ",
          ],
        },
      ],
      description: `
                מכינים בצק פריך: במיקסר עם וו גיטרה מערבלים היטב חמאה רכה ואבקת סוכר לקבלת קרם אחיד. מוסיפים ביצה ומלח וממשיכים לעבד לאיחוד. מוסיפים את שאר הרכיבים: שקדים טחונים, קקאו, קמח ואבקת אפיה וממשיכים לעבד עד שמתקבלים גושי בצק גדולים. במידה והבצק עדיין פירורי אפשר להוסיף כף חלב. מחלקים את הבצק ל 2 חלקים. מרדדים כל חלק בין שני ניירות אפיה חלקים לעובי של 3 מ"מ. מעבירים להקפאה של חצי שעה לפחות. 
                בנתיים מכינים את המלית: בסיר קטן מרתיחים שמנת מתוקה ודבש. בקערה נוספת מניחים שוקולד לבן ופקאן סיני. יוצקים את השמנת הרותחת על השוקולד וממתינים כדקה. טוחנים בעזרת בלנדר מוט, יחד עם הפקאן. חשוב להקפיד שלא ישארו חתיכות גדולות של הפקאן כדי שהגנאש יהיו נוח לזילוף. מוסיפים את החמאה וטוחנים שוב למרקם חלק. מעבירים לשק זילוף ולמנוחה במקרר למספר שעות, עדיף לילה.
                קורצים, אופים וממלאים: מוציאים את הבצק הקפוא וחותכים בזריזות בעזרת סרגל וסכין ארוכה או גלגלת פיצה, מלבנים קטנים ואחידים. אני חתכתי לגודל 2.5 * 4.5 ס"מ, הגודל האידאלי לדעתי. אפשר להיעזר בקורצן מלבני או עגול בגודל דומה לקבלת עוגיות אחידות בגדלן. במהלך החיתוך/ קריצה הבצק מעט מפשיר. כדי שיהיה קל לחלץ אותו כדאי להחזיר את התבנית למקפיא למספר דקות, ורק אז להפריד את העוגיות ולהניח בצורה מרווחת ב 2 תבניות תנור מרופדות בניר אפיה. אופים 10 דקות בתנור מחומם ל 180 מעלות, נזהרים מאפיית יתר. מצננים היטב.
                מזלפים על מחצית מהעוגיות גנאש שוקולד לבן, ומניחים בעדינות את העוגייה הנוספת. מקפיאים כחצי שעה כדי שיתיצבו לפני הציפוי.
                מצפים את העוגיות: בקערה חסינת חום מניחים שוקולד חלב, 100 גר' שוקולד מריר, ושמן. מניחים את הקערה על סיר עם מים חמים ברתיחה עדינה, מקפידים שתחתית הקערה לא תיגע במים החמים. השוקולד ימס לאט עד לקבלת נוזל חלק. בנוסף, מניחים 50 גר' שוקולד מריר קצוץ בשק זילוף. מניחים בתוך כוס עם מים רותחים עד להמסת השוקולד.
                בעזרת מזלג, טובלים כל סנדוויץ' עוגיות בקערת השוקולד המומס מרימים ומנערים מעודפי השוקולד , מניחים בעדינות על מגש מרופד בנייר אפיה. חוזרים על הפעולה עם כל העוגיות, יוצרים חור קטן מאד בשק הזילוף עם השוקולד המריר ומזלפים פסים דקים של שוקולד מריר לעיטור העוגיות. מעבירים את המגש לצינון של שעה במקפיא ומפרידים את העוגיות מנייר האפיה.
            `,
      category: "פרווה",
      favorite: false,
      img: "/Images/26.jpg",
    },
    {
      id: 27,
      name: "טארט אוקיינוס",
      time: "שעה וחצי",
      ingredients: [
        {
          title: "לבצק פריך בלונדיז",
          ingredientsList: [
            "150 גר' חמאה בטמפ. חדר",
            "½ כוס סוכר דמררה (100 גר')",
            "קורט מלח",
            "ביצה",
            "4 כפות שקדים מולבנים טחונים (40 גר')",
            "כוס קמח (240 גר')",
          ],
        },
        {
          title: "לקומפוט פירות יער",
          ingredientsList: [
            "⅔ כוס מים (150 גר')",
            "¼ כוס מחית קסיס (50 גר')",
            "⅓ כוס + כף סוכר (75 גר')",
            "כפית תמצית וניל",
            "גרידה מחצי לימון",
            "כפית קורנפלור",
            "80 גר' תותים / אוכמניות קפואות",
          ],
        },
        {
          title: "לפיננסייר",
          ingredientsList: [
            "100 גר' חמאה",
            "3 חלבונים",
            "120 גר' אבקת סוכר",
            "6 כפות שקדים מולבנים טחונים (60 גר')",
            "4 כפות קמח (40 גר')",
            "½ כפית אבקת אפיה",
          ],
        },
        {
          title: "לגנאש שוקולד מריר מוקצף",
          ingredientsList: [
            "½ 1 כוסות שמנת מתוקה (360 מ",
            "140 גר' שוקולד מריר קצוץ",
          ],
        },
        {
          title: "לגנאש שוקולד בלונדי מוקצף",
          ingredientsList: [
            "¼ 1 כוסות שמנת מתוקה (300 מ",
            "100 גר' שוקולד בלונדי קצוץ (ביתי או קנוי)",
            "25 גר' גלוקוזה",
          ],
        },
        {
          title: "לשנטילי (קצפת) הדרים",
          ingredientsList: [
            "½ כוס שמנת מתוקה (120 מ",
            "2 כפות סוכר (25 גר')",
            "חצי כפית תמצית וניל",
            "גרידה מחצי תפוז"],
        },
      ],
      description: `
                מתחילים בהכנת הגנאשים המוקצפים: לגנאש שוקולד מריר – מחממים לסף רתיחה 120 מ"ל שמנת מתוקה, יוצקים אותה על שוקולד מריר קצוץ המונח בכלי עמוק וצר. ממתינים כדקה וטוחנים בעזרת בלנדר מוט. מוסיפים את יתרת השמנת המתוקה (240 מ"ל) ומבלנדרים שוב, מכסים ומעבירים למקרר לצינון לפחות ללילה.
        
                באותה צורה מכינים גנאש בלונדי – מחממים 100 מ"ל שמנת מתוקה וגלוקוזה לסף רתיחה, יוצקים אותה על שוקולד בלונדי קוץ המונח בכלי עמוק וצר, ממתינים כדקה ומבלנדרים. מוסיפים את יתרת השמנת המתוקה (200 מ"ל) מבלנדרים, מכסים ומצננים לילה.
        
                מכינים קצפת הדרים – מערבבים שמנת מתוקה, סוכר, תמצית וניל וגרידת תפוז בכלי קטן, מכסים ומצננים לילה לספיגת טעמים.
        
                לפיננסייר: מכינים חמאה אגוזית – ממיסים את החמאה בסיר קטן וממשיכים לבשל אותה כ 5-7 דקות עד שהיא משחימה ומעלה ריח אגוזי נפלא. נזהרים שלא לשרוף יותר מדי. מעבירים לכלי נוסף לצינון. מסננים את החמאה מחלקי החלב השרופים.
        
                בקערה טורפים: חלבונים, אבקת סוכר, ושקדים טחונים . מוסיפים קמח ואבקת אפיה וטורפים שוב לאיחוד. מזלפים את החמאה האגוזית באיטיות, וטורפים היטב לקבלת עיסה אחידה. מעבירים לשק זילוף ומצננים לילה במקרר.
        
                לבצק הפריך: בקערת מיקסר מערבלים חמאה, סוכר ומלח לתערובת קרמית אחידה. מוסיפים ביצה ומערבבים לאיחוד. מוסיפים שקדים, וניל וקמח ומערבלים לקבלת בצק אחיד. מרדדים את הבצק בין שני ניירות אפיה לעובי של 3 מ"מ. מקפיאים ל 10 דקות ומפרידים מנייר האפיה.
        
                משמנים רינג בקוטר הרצוי במעט חמאה,קורצים בעזרתו עיגול מהבצק הקר ומניחים על מגש מרופד בנייר אפיה, מסמנים רצועות בגובה הרצוי ומרפדים את דפנות הרינג בצורה מהודקת. מסירים עודפי בצק משפת הרינג בעזרת סכין חדה. מקפידים לעבוד עם הבצק בזריזות כשהוא קר ונוח להתעסקות. דוקרים את הבצק ומקפיאים לשעה לפחות.
        
                מכינים קומפוט פירות יער: מערבבים בסיר מחית קסיס, מים, סוכר, ווניל, גרידת לימון וקורנפלור. מרתיחים ומבשלים מספר דקות להסמכה. מוסיפים תותים קפואים חתוכים לחתיכות גסות או אוכמניות שלמות קפואות ומצננים היטב.
        
                אופים את הבצק: מחממים תנור ל 200 מעלות, מכסים את הבצק הקפוא בניר אפיה ועליו מניחים קטניות כמו – חומוס, שעועית – שישמשו כמשקולות לבצק בזמן האפיה. אופים 12 דקות, מסירים את נייר האפיה עם המשקולות ואופים עוד 5 דקות לייבוש נוסף של הבצק.
        
                מניחים במרכז הטארט את הקומפוט, ומזלפים מסביבו את תערובת הפיננסייר. מזלפים גם מעל הקומפוט את הפיננסייר הנותר בשכבה אחידה. אופים בתנור מחומם ל 175 מעלות כחצי שעה עד להזהבת הפיננסייר. מצננים היטב לפני העיטור.
        
                מכינים עיטורי שוקולד: ממיסים שוקולד בלונדי ומורחים אותו בשכבה אחידה על שקית ניילון פלסטית מהסוג העבה והחלק (לא המרשרשות של הסנדוויץ') . ממתינים מעט, מניחים שקית עבה נוספת מעל השוקולד, ומגלגלים את השקיות בעדינות כמו רולדה הדוקה. מעבירים לצינון במקרר עד שהשוקולד מתקשה, ואז פותחים את השקית בעדינות – מתקבלים חצאי צינורות ושברים עדינים. שומרים בקירור עד לשימוש.
        
                ממש לפני העיטור מקציפים: קצפת הדרים ומעבירים לשק זילוף עם פייה חלקה. מקציפים את הגנאש הבלונדי לקצפת יציבה ומעבירים לשק זילוף עם פייה מסוג שונה. מקציפים את הגנאש המריר ומעבירים לשק זילוף עם פייה משוננת. (שמתם לב שהלכנו מהבהיר אל הכהה? זה בשביל שלא תצטרכו לשטוף את קערת המיקסר בין הקצפה להקצפה 🙂 )
        
                מזלפים את שלשת סוגי הקצפות על פני הטארט ומעטרים בשברי שוקולד בלונדי.
            `,
      category: "פרווה",
      favorite: false,
      img: "/Images/27.jpg",
    },

    {
      id: 28,
      name: "טארט תות פיסטוק",
      time: "45 דקות",
      ingredients: [
        {
          title: "לבצק פריך פיסטוק",
          ingredientsList: [
            "100 גר' אבקת סוכר",
            "2 כפות פיסטוקים קלופים (20 גר')",
            "200 גר' חמאה",
            "קורט מלח",
            "2 כוסות קמח (280 גר')",
            "ביצה"
          ]
        },
        {
          title: "למרציפן פיסטוק",
          ingredientsList: [
            "100 גר' שקדים מולבנים טחונים",
            "3 כפות פיסטוקים קלופים (30 גר')",
            "½ כוס סוכר",
            "4 כפות מים (40 גר')",
            "2 כפות מחית פיסטוק (20 גר')"
          ]
        },
        {
          title: "למוס תות ושוקולד לבן",
          ingredientsList: [
            "4 גר' ג'לטין מומס ב 20 גר' מים קרים",
            "200 גר' תותים קפואים (1/3 1 כוסות)",
            "¼ כוס סוכר",
            "כף מיץ לימון סחוט",
            "100 גר' שוקולד לבן",
            "240 שמנת מתוקה"
          ]
        },
        {
          title: "לעיטור",
          ingredientsList: [
            "240 מל שמנת מתוקה",
            "כף אבקת פודינג וניל",
            "פיסטוקים",
            "תותים טריים",
            "100 גר' שוקולד רובי"
          ]
        }
      ],


      description: `מכינים מרציפן פיסטוק: במעבד מזון טוחנים פיסטוקים ושקדים. בסיר קטן מניחים סוכר ומים, מרתיחים תוך כדי ערבוב (זהירות מקירמול הסוכר!) ומבשלים מספר דקות לקבלת סירופ סמיך. יוצקים את הסירופ על השקדים במעבד מזון תוך כדי ההפעלה, למשך מספר שניות. מוסיפים את מחית הפיסטוק ומעבדים שוב. מתקבל מרציפן ירקרק, מעין בצק חלק ואחיד. מרדדים בין שני נירות אפיה חלקים לעיגול בקוטר כ 30 ס"מ. מעבירים למקפיא.
מכינים בצק פריך: במעבד מזון (לא חייבים לנקות אותו מהמרציפן) טוחנים אבקת סוכר ופיסטוקים. מוסיפים קמח, חמאה קרה חתוכה לקוביות, ומלח. טוחנים שוב לקבלת פירורים דקים. מוסיפים ביצה ומעבדים מעט רק עד לקבלת גושי בצק. מרדדים את הבצק בין שני נירות אפיה חלקים לעובי המתאים לתבנית בה תשתמשו. לטארטלטים – בצק בעובי 4-5 מ"מ, לטארט גדול – ניתן לרדד לבצק מעט עבה יותר. מעבירים את הבצק להקפאה למשך כחצי שעה.
מרפדים את תבניות הטארט: אם משתמשים ברינגים מחוררים – חשוב לשמן את הרינג בעזרת מעט חמאה כעת. מסירים את ניר האפיה העליון מעל פני הבצק. הבצק צריך להיות חצי קפוא, כלומר – קר מספיק כדי שיפרד בקלות מניר האפיה, אך לא קפוא לגמרי כדי שנוכל לרפד את התבניות בלי שהוא ישבר. עובדים בזריזות כדי שלא יפשיר מהר מדי. קורצים בעזרת הרינג הרצוי את תחתית הטארט, ומעבירים את הרינג והבצק המתאים לתבנית תנור מרופדת בניר אפיה. בעזרת סכין חדה חותכים רצועות בצק בגובה הרינג , מצמידים את הרצועות לדפנות הרינג ומהדקים לבצק שבתחתית. מסירים עודפי בצק משפת הרינג בעזרת סכין חדה. מחוררים את הבצק בעזרת מזלג . מרפדים בצורה כזו את כל הרינגים, במידה והבצק הפשיר וכבר קשה לעבוד אתו – מחזירים להקפאה קצרה. מקפיאים את הרינגים עם הבצק לפחות שעה לפני האפיה.
אופים את הטארט: מחממים תנור ל 200 מעלות. מניחים בזהירות ניר אפיה בגודל הטארט על פני הבצק הקפוא כולל הדפנות, וממלאים בקטניות עד שפת הרינג. השתדלו כמה שפחות לקמט את ניר האפיה כדי שגם הבצק שתחתיו יישאר חלק לאחר האפיה. אופים כ 15 דקות עד ששפתי הבצק מזהיבות. מסירים את ניר האפיה עם הקטניות ומצננים לחלוטין.
מכינים מוס תותים: כלי קטן מערבבים אבקת ג'לטין ומים קרים ומשהים לספיגה כ 15 דקות. חותכים את התותים לחתיכות גסות ומניחים בסיר קטן עם הסוכר, המים ומיץ הלימון. מרתיחים ומבשלים 10 דקות עד שהתותים מתרככים לגמרי. במיכל צר מניחים שוקולד לבן ואת ספוג הג'לטין, יוצקים את רוטב התותים על השוקולד הלבן והג'לטין, ממתינים כדקה וטוחנים בעזרת בלנדר מוט לקבלת קרם חלק בצבע ורוד – סגלגל. מצננים לטמפרטורת חדר. בקערת מיקסר עם מקצ, בלון מקציפים שמנת מתוקה למרקם יוגורט (לא הקצפה מלאה) מוסיפים לערבל במהירות נמוכה תוך כדי הוספת קרם התותים. מקפלים בעזרת מרית לקבלת מוס אחיד.
מרכיבים את הטארט: מעבירים את המוס לשק זילוף ומזלפים שכבת מוס דקה על תחתית הטארט. מוציאים את המרציפן מהמקפיא וקורצים ממנו עיגול או מלבן קטן מגודל הרינג. מניחים את דיסקית המרציפן מעל שכבת המוס הדקה ומכסים במוס עד לגובה הטארט. מיישרים בזהירות בעזרת פלטה מדורגת וממלאים כך את שאר הרינגים. מעבירים למקפיא להתייצבות של שעה- שעתיים
מכינים דסקיות שוקולד: ממיסים שוקולד רובי במיקרוגל בפולסים של 30 שניות עד להמסה מלאה. יוצקים את השוקולד על דף גיטרה בגודל A4 (חושבים על דף תווים? לא ממש.. קראו בכדאי לדעת מה זה בדיוק ומה עושים בלעדיו) משטחים מעט ומניחים עליו דף גיטרה נוסף, מישרים ומהדקים בעזרת מערוך כך שמתקבלת שכבה דקיקה של שוקולד בין שתי יריעות הפלסטיק. ממתינים שתי דקות להתייצבות השוקולד, וקורצים את השוקולד עם הניילון עיגולים בקוטר 3-4 ס"מ. מעבירים למקרר לרבע שעה עד להתקשות מוחלטת של השוקולד. מסירים את הפלסטיק בתנועה מהירה ושומרים בצד.
מקשטים את הטארט : מקציפים שמנת מתוקה עם אבקת פודינג וניל לקבלת קצפת יציבה ונוחה לזילוף. מעבירים לשק זילוף אם צנטר חלק ומזלפים תלוליות על פני הטארט. מפזרים שברי פיסטוקים, קוביות תותים ודסקיות שוקולד.`,
      category: "קינוחים",
      favorite: false,
      img: "/Images/28.jpg"
    },
    {
      id: 29,
      name: "טארט שוקולד אגוזים וגנאש קרמל",
      time: "שעה",
      ingredients: [
        {
          title: "לבצק פריך קקאו",
          ingredientsList: [
            "כוס קמח (140 גר)",
            "רבע כוס קקאו (35 גר)",
            "100 גר' חמאה קרה",
            "4 כפות אבקת סוכר (40 גר)",
            "קורט מלח",
            "חלמון",
            "כף חלב לפי הצורך"
          ]
        },
        {
          title: "למלית קרם אגוזי לוז ושוקולד",
          ingredientsList: [
            "100 גר' + חופן אגוזי לוז קלויים",
            "50 גר' שוקולד מריר",
            "100 גר' חמאה קרה",
            "1/2 כוס סוכר דמררה (100 גר')",
            "קורט מלח",
            "2 כפות שטוחות קמח (20 גר')",
            "ביצה",
            "3 כפות חלב (30 מל')"
          ]
        },
        {
          title: "לגנאש שוקולד קרמל",
          ingredientsList: [
            "3 כפות סוכר (30 גר')",
            "3/4 כוס שמנת מתוקה",
            "קורט מלח",
            "100 גר' שוקולד חלב קצוץ",
            "60 גר' שוקולד מריר קצוץ",
            "50 גר' חמאה חתוכה לקוביות קטנות"
          ]
        }
      ],
      description: "הכנה: \n\nלבצק פריך: במעבד מזון מעבדים קמח, קקאו, אבקת סוכר מלח וחמאה לפירורים דקים. מוסיפים חלמון, ומעבדים לאיחוד. אם יש צורך מוסיפים מעט חלב. עוטפים בניילון נצמד ומעבירים למקרר לשעה. \nמפזרים מעט קקאו וקמח על משטח עבודה (כדי שהבצק יישאר כהה) מרדדים את הבצק לעובי כחצי ס\"מ ומרפדים תבנית פאי או רינג. דוקרים את הבצק במזלג ומקפיאים לשעה לפחות. \nפורשים ניר אפיה על הבצק הקפוא, וממלאים אותו בקטניות. אופים את הבצק בתנור מחומם היטב, 180 מעלות כ 15 דק מסירים ניר האפייה והמשקולות.\nלקרם אגוזים ושוקולד: במעבד מזון טוחנים שוקולד ו100 גר' אגוזי לוז. מוסיפים את שאר החומרים ומעבדים לקרם אחיד.\nיוצקים את הקרם מעל הקלתית החצי אפויה. את אגוזי הלוז הנותרים קוצצים מעט ומפזרים מעל שכבת הקרם.\nאופים כ 25 דקות בחום 180 מעלות. מצננים מעט.\nלגנאש קרמל: מחממים היטב קלחת קטנה. מפזרים סוכר בתחתית הסיר וממתינים לקבלת קרמל ענברי. נזהרים מאד שלא לשרוף!\nבמקביל, מרתיחים בסיר קטן שמנת ומלח. כשהקרמל מוכן, מוסיפים את השמנת החמה בזרזוף עדין לקרמל ובוחשים היטב בכף עץ. מבשלים כמה דקות להסמכה.\nמסירים מהאש ומוסיפים את השוקולד הקצוץ. ממתינים דקה וטורפים היטב לקבלת גנאש חלק. מוסיפים חמאה וטורפים שוב עד שהיא נבלעת בתערובת.\nיוצקים מעל המלית האפויה ומעטרים בעוד כמה אגוזי לוז ושוקולד (שלא יחסר חלילה).",
      category: "קינוחים",
      favorit: false,
      img: "/Images/29.jpg"
    },
    {
      id: 30,
      name: "עוגת רד וולווט – פטל וגבינה",
      time: "שעתיים",
      ingredients: [
        {
          title: "לעוגת פטל",
          ingredientsList: [
            "2 1/4 כוסות קמח (315 גר')",
            "1/2 1 כפיות אבקת אפיה",
            "1/4 כפית סודה לשתייה",
            "3/4 כפית מלח",
            "1/2 כוס שמנת מתוקה / צמחית (120 מל",
            "1/4 כוס מחית פטל (60 גר')",
            "1/4 כוס מים (60 גר')",
            "100 גר' חמאה / מחמאה",
            "1 1/2 כוסות סוכר (300 גר')",
            "1/4 כוס שמן (60 גר')",
            "3 ביצים",
            "כפית קקאו",
            "1/2 1 כפיות תמצית וניל",
            "כפית חומץ",
            "ג'ל צבע מאכל אדום"
          ]
        },
        {
          title: "לקרם פטל",
          ingredientsList: [
            "3/4 כוס + 2 כפות מחית פטל (200 גר')",
            "1/2 כוס סוכר (100 גר')",
            "1/2 כוס מים (120 גר')",
            "כף קורנפלור",
            "כף חמאה / מחמאה"
          ]
        },
        {
          title: "לקרם חמאה מרנג וגבינת שמנת (חמר\"ש)",
          ingredientsList: [
            "2 חלבונים",
            "1/2 כוס סוכר (100 גר')",
            "200 גר' חמאה בטמפ' חדר",
            "225 גר' גבינת שמנת",
            "קורט מלח"
          ]
        }
      ],
      description: `
        מכינים את העוגה: מערבבים בקערה את החומרים היבשים: קמח, מלח, אבקת אפיה וסודה לשתיה. בכלי נוסף מערבבים את הנוזלים: מחית פטל, שמנת מתוקה ומים.
        בקערת מיקסר עם וו גיטרה מניחים חמאה וסוכר ומערבלים עד שהחמאה מתרככת ומתקבל קרם לבן ואחיד. מוסיפים שמן ומערבלים עוד דקה. מוסיפים ביצה אחר ביצה ומערבלים עד לאיחוד.
        מוסיפים קקאו, חומץ ותמצית וניל, ומתחילים להוסיף צבע מאכל אדום. מוסיפים לסירוגין את תערובת הקמח והנוזלים עד לקבלת עיסה אחידה.
        מעבירים לתבנית עגולה בקוטר 20-22 ס"מ, או רינגים אישיים. אופים בתנור מחומם ל-180 מעלות. (כ-35-40 דקות או 20 דקות לרינגים אישיים).
        מצננים את העוגה.
        
        מכינים קרם פטל: מבשלים מחית פטל, סוכר ומים. מוסיפים קורנפלור ומבשלים עוד מספר דקות. מכבים את האש ומוסיפים חמאה. מקררים.
        
        מכינים קרם חמר"ש: מקציפים חלבונים וסוכר עד שהמרנג יציב. מוסיפים חמאה בהדרגה, ואז גבינת שמנת. מעבירים לשקית זילוף.
        
        מרכיבים את העוגה: חותכים את העוגה לשלוש שכבות, מורחים קרם פטל בין השכבות ומזלפים קרם חמר"ש.
        מצננים במקרר לפחות שעתיים. 
      `,
      category: "פרווה",
      favorite: false,
      img: "/Images/30.jpg"
    }
    ,
    {
      id: 31,
      name: "טארט פירות אפוי",
      time: "40 דקות",
      ingredients: [
        {
          title: "לחלב מרוכז",
          ingredientsList: [
            "1 ליטר חלב",
            "1/2 2 כוסות סוכר (500 גר')",
            "50 גר' חמאה",
            "4 כפות קורנפלור",
            "1/2 כוס מים"
          ]
        },
        {
          title: "לבצק פריך",
          ingredientsList: [
            "3/4 1 כוסות קמח (250 גר')",
            "2/3 כוס שקדים טחונים (70 גר')",
            "1/2 כוס + כף אבקת סוכר (70 גר')",
            "160 גר' חמאה קרה",
            "ביצה"
          ]
        },
        {
          title: "למלית פירות",
          ingredientsList: [
            "3 חלמונים",
            "1/2 1 כוסות חלב מרוכז (400 גר')",
            "2/3 כוס מחית פסיפלורה / פירות יער (160 מ או 1/3 כוס מכל סוג (80 מ"
          ]
        },
        {
          title: "למרנג שוויצרי",
          ingredientsList: [
            "2 חלבונים",
            "1/2 כוס סוכר (100 גר')"
          ]
        }
      ],
      description: `הכנה:\n\nמתחילים בהכנת חלב מרוכז: בסיר גדול מרתיחים חלב וסוכר. מבשלים על להבה בינונית כחצי שעה. מוסיפים קוביות חמאה ומערבבים להמסה מלאה. בכוס קטנה מערבבים מים עם קורנפלור ומזלפים לחלב הרותח בהדרגה. חשוב לערבב כל הזמן כדי למנוע גושים וחריכה. מבשלים 15 דקות עד שמתקבל קרם סמיך מאוד. מניחים על הקרם ניילון נצמד ומצננים במקרר.\n\nמכינים בצק פריך: במעבד מזון טוחנים קמח, שקדים טחונים, אבקת סוכר, מלח וחמאה לפירורים דקים. מוסיפים ביצה ומעבדים לאיחוד. עוטפים בניילון נצמד ומעבירים למקרר לשעה. מרדדים את הבצק לעובי 1/2 ס"מ, קורצים עיגולים בגודל המתאים לרינגים ומרפדים אותם. דוקרים במזלג ומקפיאים לשעה. אופים בתנור מחומם ל-180 מעלות כ-15 דקות עד שהבצק מזהיב.\n\nמכינים את המלית: בקערת מיקסר מקציפים את החלמונים כ-5 דקות עד שמקבלים תערובת תפוחה. מוסיפים את החלב המרוכז ומערבבים עד שהקרם חלק. מוסיפים את מחית הפירות ומערבבים. אם משתמשים ב-2 סוגי פירות, מחלקים את התערובת לשניים ומוסיפים לכל חלק מחית פירות מתאימה.\n\nיוצקים את הקרם בזהירות לקלתית האפויה ואופים כ-10 דקות עד שהמלית מתייצבת בקצוות. המרכז יישאר רוטט וזה בסדר. מצננים את הטארטים.\n\nאם רוצים להוסיף מרנג שוויצרי: מחממים חלבונים וסוכר בקערה מעל סיר עם מים רותחים עד שהסוכר נמס לחלוטין. מקציפים במיקסר עד שהמרנג יציב ומבריק. מזלפים מעל הטארטים בעזרת שקית זילוף, ויוצרים גבעות קטנות. אם רוצים, ניתן להוסיף גימור שרוף בעזרת ברנר או לתנור בגריל.`,
      category: "קינוחים",
      favorite: false,
      img: "/Images/31.jpg"
    },
    {
      id: 32,
      name: "אוזני המן שוקו צ'יפס",
      time: "שעתיים וחצי",
      ingredients: [
        {
          title: "לבצק פריך",
          ingredientsList: [
            "3 כוסות פחות כף קמח (410 גר')",
            "3 כפות קקאו קקאו (30 גר')",
            "כף אבקת שוקו (10 גר')",
            "1 כפית שטוחה אבקת אפיה (2 גרם)",
            "250 גר חמאה/מחמאה קרה חתוכה לקוביות",
            "150 גר אבקת סוכר",
            "½ כפית תמצית וניל",
            "1/4 כוס שמנת מתוקה / צמחית (60 מל')"
          ]
        },
        {
          title: "למילוי בצק עוגיות",
          ingredientsList: [
            "200 גרם חמאה/מחמאה",
            "1 כוס סוכר (200 גר')",
            "1/4 כוס סוכר חום כהה (50 גר')",
            "1 ביצה",
            "1 כפית תמצית וניל",
            "2 כוסות + כף גדושה קמח לבן (300 גרם)",
            "1 כפית סודה לשתייה",
            "250 גרם שוקולד מריר קצוץ גס או מיני שוקולד צ'יפס"
          ]
        }
      ],
      description: `
        מתחילים עם הכנת המלית – בצק עוגיות: בסיר ממיסים חמאה ומוסיפים סוכר. טורפים לאיחוד ומוסיפים ביצה ותמצית וניל. לאחר מכן מוסיפים קמח, סודה לשתייה ושוקולד קצוץ ומערבבים. מכסים בניילון נצמד ומעבירים למקרר לשעה לפחות.
        
        מכינים בצק פריך במעבד מזון: מכניסים את כל החומרים היבשים למעבד מזון ומעבדים עם חמאה עד שהתערובת מתפזרת לפירורים דקים. מוסיפים שמנת ותמצית וניל ומעבדים עד שמתקבלים גושי בצק.
        
        מרדדים את הבצק בין שני ניירות אפייה ומקפיאים לשעה לפחות. קורצים עיגולים בקוטר 6-8 ס"מ ומניחים עליהם מעט מלית עוגיות ושוקולד קצוץ. מהדקים את הקצוות ומבשלים 12 דקות בתנור על 190 מעלות.
        
        אפשר להקפיא את העוגיות לאחר האפייה.
      `,
      category: "פרווה",
      favorite: false,
      img: "/Images/32.jpg"
    }
    ,
    {
      id: 24,
      name: "בראוניז עם דברים טובים",
      time: "שעה",
      ingredients: [
        {
          title: "חומרים",
          ingredientsList: [
            "85 גר' חמאה או מחמאה",
            "200 גר שוקולד מריר",
            "3/4 כוס סוכר (150 גר')",
            "2 ביצים",
            "כפית תמצית וניל",
            "1/4 כוס קמח / קורנפלור (35 גר')",
            "1/2 כוס שוקולד ציפס/קצוץ (100 גר')",
            "כ 1/2 כוס תוספות שבורות גס (50-100 גר' עדשים, קליק, שברי עוגיות, אגוזים וכו')"
          ]
        }
      ],
      description: "ממיסים חמאה ושוקולד במיקרוגל עד שהתערובת חלקה. מוסיפים את יתר החומרים וטורפים במשך כדקה. מוסיפים את התוספות המועדפות ומערבבים בעדינות. משטחים את התערובת בתבנית ומפזרים עוד תוספות. מכניסים לתנור חם על 180 מעלות למשך כ-20 דקות. מצננים במקרר וחותכים לריבועים בגודל הרצוי.",
      category: "פרווה",
      favorite: false,
      img: "/Images/33.jpg"
    }
    ,
    {
      id: 34,
      name: "עוגיות שוקולד צ'יפס ממולאות",
      time: "45 דקות",
      ingredients: [
        {
          title: "מילוי",
          ingredientsList: [
            "½ צנצנת ממרח שוקולד אגוזים (צ'וקטה למשל)"
          ]
        },
        {
          title: "לבצק עוגיות",
          ingredientsList: [
            "200 גר' חמאה / מחמאה בטמפרטורת חדר",
            "½ כוס סוכר (100 גר')",
            "¾ כוס סוכר חום כהה / דמררה (180 גר')",
            "כפית מלח",
            "2 כפיות תמצית וניל",
            "2 ביצים L",
            "¼ 2 כוסות קמח (315 גר')",
            "½ כפית אבקת סודה לשתיה",
            "250 גר' שוקולד צ'יפס / שוקולד מריר קצוץ גס"
          ]
        }
      ],
      description: "אופן ההכנה:\n\nמכינים את המילוי: מעבירים את הממרח לשקית זילוף ומזלפים בתבניות סיליקון בצורות קטנות – חצאי כדור או מטבעות לדוגמא. ניתן גם סתם לזלף גבעות קטנות של ממרח על נייר אפיה. מקפיאים לחצי שעה ומחלצים מהתבניות. שומרים במקפיא.\n\nמכינים בצק עוגיות: בקערת מיקסר עם וו גיטרה מניחים חמאה עם שני סוגי סוכר ומערבלים כ 5 דקות לקבלת קרם אחיד. מוסיפים מלח, תמצית וניל וביצים וממשיכים לערבל לאיחוד. מוסיפים קמח, אבקת סודה לשתיה ו 200 גר' שוקולד צ'יפס ומערבלים רק עד לאיחוד. עדיף לקרר את הבצק כשעה במקרר.\n\nמרכיבים את העוגיות: מרפדים תבנית תנור בנייר אפיה. לכל עוגיה מכינים שני כדורים – אחד גדול יחסית, בגודל כדור פלאפל, והשני קטן יותר – בגודל מסטיק עגול. משטחים את הכדור הגדול על נייר האפיה, מניחים במרכזו את מטבע המילוי הקפוא, ומשxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxון כך שיעטפו את כל המילוי ומהדקים מסביב כך שנוצרת עוגיה שלמה. חוזרים על התהליך עם כל כמות הבצק, שומרים על רווח גדול בין כל עוגיה. את שאריות השוקולד צ'יפס מניחים על העוגיות. מקפיאים את המגש כחצי שעה לפחות לפני האפיה.\n\nאופים: מחממים תנור ל 180 מעלות ואופים 12-15 דקות עד שהעוגיות מזהיבות. מצננים כמה דקות מחוץ לתנור וזהו. הסוף ידוע מראש…",
      category: "קינוחים",
      favorite: false,
      img: "/Images/34.jpg"
    },
    {
      id: 35,
      name: "כוסות ס'מורס",
      time: 0,
      ingredients: [
        {
          title: "לתחתית קראנץ בייגלה",
          ingredientsList: [
            "2 כוסות בייגלה (150 גר')",
            "3 כפות חמאת בוטנים (75 גר')",
            "4 כפות סוכר חום דמררה (40 גר')"
          ]
        },
        {
          title: "למוס מרשמלו",
          ingredientsList: [
            "3 כוסות דחוסות מרשמלו וניל (150 גר')",
            "200 גר' שוקולד מריר",
            "2 מיכלי קצפת צמחית (500 מ"
          ]
        },
        {
          title: "לקרם שוקולד חמאת בוטנים",
          ingredientsList: [
            "מיכל קצפת צמחית (240 גר')",
            "120 גר' שוקולד מריר",
            "2 כפות חמאת בוטנים (50 גר')"
          ]
        },
        {
          title: "לעיטור",
          ingredientsList: [
            "חופן מרשמלו לבן",
            "כף אבקת סוכר",
            "חופן בייגלה ארוכים"
          ]
        }
      ],
      description: "אופן ההכנה:\n\nמכינים את תחתית הקראנץ: מרסקים את הבייגלה לפירורים גסים, בפולסים במעבד מזון או בשיטה הפרימיטיבית בעזרת פטיש שניצל. ממיסים חמאת בוטנים במיקרוגל ומערבבים היטב עם הבייגלה והסוכר עד לאיחוד. מניחים כף מהפירורים בתחתית כל כוס. (זהירות לא לזלול!)\n\nמכינים מוס מרשמלו: גוזרים את המרשמלו לחצאים, ומניחים עם קוביות השוקולד בכלי עמוק. מוסיפים ⅓ כוס קצפת צמחית (80 גר') ומחממים במיקרו כדקה. מערבבים לקבלת עיסת שוקולד חלקה, אם יש צורך מחממים עוד חצי דקה במיקרו (להיזהר מחימום יתר). משאירים להתקרר מעט.\n\nמקציפים את יתרת הקצפת הצמחית למרקם יוגורט (מפסיקים לפני שהקצפת יציבה מדי) מוסיפים את תערובת השוקולד ומערבבים במהירות נמוכה לאיחוד. מעבירים לשק זילוף ומזלפים מעל הקראנץ בכוסות. מקפיאים לשעתיים לפחות.\n\nמכינים את קרם השוקולד: מניחים במיכל שוקולד, קצפת, וחמאת בוטנים. ממיסים במיקרו בפולסים של 30 שניות ומערבבים היטב. יוצקים לשכבה אחידה וחלקה מעל כוסות המוס.\n\nלעיטור: גוזרים פרוסות מרשמלו, מאבקים את הפרוסות במעט אבקת סוכר (כדי שלא יהיו דביקות) ויוצרים חור במרכז כל פרוסה בעזרת שיפוד. מרחיבים מעט את החור ומשחילים 3 פרוסות על כל בייגלה. אפשר לשרוף מעט את המרשמלו בעזרת ברנר.",
      category: "קינוחים",
      favorite: false,
      img: "/Images/35.jpg"
    },
    {
      id: 36,
      name: "עוגיות בראוניז פסחיות",
      time: "25 דקות",
      ingredients: [
        {
          title: "",
          ingredientsList: [
            "200 גרם שוקולד מריר",
            "125 גרם חמאה / 90 גרם שמן קוקוס / 80 מל שמן אגוזים",
            "2 ביצים",
            "½ כוס סוכר (100 גר')",
            "½ כוס סוכר חום דמררה (100 גר')",
            "¼ כפית מלח",
            "1 כוס פחות כף קמח תפוחי אדמה (130 גרם)",
            "3 כפות קקאו (30 גרם)",
            "1 כפית אבקת אפייה"
          ]
        },
        {
          title: "לציפוי",
          ingredientsList: [
            "מלח גס",
            "חופן שוקולד ציפס – לבחירה"
          ]
        }
      ],
      description: `בסיר קטן ממיסים חמאה/שמן ושוקולד על להבה בינונית תוך כדי ערבוב (נזהרים שהשוקולד לא ישרף). בקערת מיקסר מקציפים ביצים שלמות עם קורט מלח ושני סוגי הסוכר כ-5 דקות לקבלת קציפה תפוחה ובהירה. מנמיכים את מהירות המיקסר ומוסיפים את תערובת השוקולד, ואת שאר הרכיבים: קמח תפו\"א, קקאו ואבקת אפיה. מערבבים לאיחוד, עד שמתקבלת עיסה סמיכה ושוקולדית. מעבירים את העיסה לשק זילוף, ומזלפים תלוליות קטנות על תבנית מרופדת בנייר אפיה, במרווחים של כ-4 ס"מ בין העוגיות. מפזרים שוקולד צ'יפס ומלח גס על העוגיות. אופים בתנור מחומם ל-180 מעלות כ-10 דקות עד שהעוגיות נסדקות ומתייצבות. מצננים היטב לפני הניתוק מנייר האפייה.`,
      category: "פרווה",
      favorite: false,
      img: "/Images/36.jpg"
    },
    {
      id: 37,
      name: " שוקולטה חמה",
      time: "5 דקות",
      ingredients: [
        {
          title: " חומרים לשוקולטה חמה",
          ingredientsList: [
            "½ 1 כוסות חלב",
            "¾ כוס שמנת מתוקה",
            "כף קקאו",
            "2 כפות סוכר",
            "קורט מלח (לבחירה)",
            "כפית תמצית וניל",
            "כף קורנפלור מומס ב ¼ כוס חלב",
            "100 גר' שוקולד (חלב או מריר)"
          ]
        }
      ],
      description: `
              בסיר קטן מרתיחים חלב, שמנת, קקאו, סוכר ותמצית וניל. אם אתם מחובבי הז'אנר המתוק מלוח – הוסיפו מעט מלח. מוסיפים לתערובת את הקורנפלור המומס בחלב ומערבבים. ממשיכים לבשל עוד 5 דקות תוך כדי ערבוב עד שהשוקו מסמיך. מסירים מהאש, מוסיפים שוקולד מריר וממתינים דקה. טורפים היטב עד שמתקבל הזהב החום הזה.. לשוקו חלק במיוחד- טוחנים את התערובת בבלנדר מוט.`,
      category: "חלבי",
      favorite: false,
      img: "/Images/37.jpg"
    },


    {
      id: 38,
      name: "עוגת מוס שוקולד לוז",
      time: "שעה וחצי",
      ingredients: [
        {
          title: "לבסיס בראוניז",
          ingredientsList: [
            "200 גרם שוקולד מריר",
            "100 גרם מרגרינה / חמאה",
            "קורט מלח",
            "1 כפית תמצית וניל",
            "½ כוס סוכר (100 גר')",
            "3 ביצים",
            "½ כוס קמח (70 גר')",
            "2 כפות ממרח שוקולד-אגוזי לוז / ממרח נוגט (40 גר')"
          ]
        },
        {
          title: "לקראנץ' לוז",
          ingredientsList: [
            "100 גר' שוקולד מריר / חלב",
            "1/3 כוס ממרח נוגט (100 גר')",
            "2/3 כוס אגוזי לוז קלויים (50 גר')",
            "½ כוס שבבי וופל / גלילית מרוסקת (50 גר')"
          ]
        },
        {
          title: "למוס שוקולד לוז",
          ingredientsList: [
            "לגרסה פרווה: 3 גר' ג'לטין + 15 גר' מים + 200 גר' שוקולד מריר",
            "לגרסה חלבית: 5 גר' ג'לטין + 25 גר' מים + 50 גר' שוקולד מריר + 150 גר' שוקולד חלב + 480 מל שמנת מתוקה / צמחית (2 כוסות) + ¼ כוס ממרח שוקולד – אגוזי לוז (85 גר')"
          ]
        },
        {
          title: "לציפוי גלייז שוקולד",
          ingredientsList: [
            "12 גר' ג'לטין + 60 גר' מים",
            "150 גר' סוכר",
            "150 גר' גלוקוזה",
            "75 גר' מים",
            "100 גר' מירור (לפרווה) / חלב ממותק (לגרסה חלבית)",
            "150 גר' שוקולד מריר / חלב קצוץ (לגרסה חלבית)",
            "½ כפית אבקת זהב",
            "כף ויסקי / אלכוהול"
          ]
        }
      ],
      description: `מכינים בסיס בראוניז: בסיר קטן ממיסים יחד שוקולד ומרגרינה או חמאה תוך כדי ערבוב ושמירה על השוקולד שלא יישרף. מוסיפים תמצית וניל, מלח, סוכר וביצים וטורפים היטב. מוסיפים את הקמח ומערבבים לאיחוד, ולבסוף –מוסיפים גם את ממרח השוקולד / נוגט ומערבבים. מעבירים את העיסה לרינג בקוטר 20 ס"מ, המונח על מגש מרופד בניר אפיה, ואופים כ 15-20 דקות עד להתייצבות. מצננים מעט. מכינים קראנץ' נוגט: במעבד מזון טוחנים אגוזי לוז לפירורים גסים, מוסיפים שבבי וופל או גליליות וטוחנים מעט . ממיסים שוקולד מריר במיקרו או בקערה חסינת חום המונחת על סיר מים רותחים (בן מארי). מוסיפים לשוקולד את ממרח הנוגט, ותערובת האגוזים הטחונה. מערבבים היטב. משטחים מיד את התערובת מעל בסיס הבראוני ומקפיאים. מכינים מוס שוקולד לוז: בכלי קטן מערבבים היטב אבקת ג'לטין ומים קרים (ממש!) ומשהים לספיחה כ 15 דקות, עד שכל הג'לטין נספג במים. קוצצים את השוקולד (מריר, או חלב ומריר) או שוברים לחתיכות קטנות. מרתיחים ½ כוס שמנת בסיר קטן. מוסיפים לשמנת הרותחת את השוקולד הקצוץ (מריר, או חלב ומריר) וג'לטין וממתינים כדקה. מוסיפים ממרח שוקולד – לוז, טורפים היטב באמצעות מטרפה או בלנדר מוט ומצננים מעט. בקערת מיקסר מקציפים ½ 1 כוסות שמנת למרקם יוגורט (לא מוקצפת מדי). מוסיפים במהירות נמוכה את תערובת השוקולד עד לקבלת תערובת אחידה. מרכיבים את העוגה: עוטפים בסיס רינג בקוטר 22 ס"מ בניר כסף בצורה הדוקה ומניחים במרכזו את שכבת הבראוניז וקראנץ הנוגט. יוצקים את מוס השוקולד – לוז מעל השכבות, מנערים בזהירות כדי להוציא בועות אויר, ומעבירים למקפיא ללילה. מכינים גלייז: בסיר קטן מניחים סוכר, מים, גלוקוזה ומביאים לרתיחה. בכלי צר ועמוק עם פיה נוחה מניחים שוקולד קצוץ, ג'לטין מוכן (משלב 4) , ומירור / חלב ממותק. יוצקים עליהם את הנוזל החם וטוחנים בעזרת בלנדר מוט לקבלת תערובת אחידה. נזהרים לא להניע את הבלנדר תוך כדי הטחינה כדי למנוע יצירת בועות אויר. מצננים את התערובת עד לטמפרטורת גוף, כך שהיא לא תרגיש חמה מדי אך לא תהיה קרה למגע. מצפים ומקשטים: מרפדים תבנית תנור בניילון נצמד, מניחים עליה קערה קטנה הפוכה, או רינג קטן כדי להגביה את המוס במהלך הציפוי. מחלצים את המוס הקפוא מהרינג על ידי חימום הדפנות מעט בעזרת הידיים, או בעזרת מטלית חמה. מניחים את המוס על גבי תחתית עגולה בקוטר כ 20 ס"מ. ניתן להשתמש במכסה של קופסת פלסטיק או כל משטח ישר ויציב בקוטר קטן יותר מהמוס עצמו. כעת מניחים את המוס על הקערה המונחת על מגש האפיה. מתחילים ליצוק בנדיבות במרכז העוגה כך שהגלייז מתפשט ונוזל גם לדפנות. עוברים ליצוק את הציפוי גם על הדפנות, סביב סביב. מקפידים שלא יישאר אזור ללא ציפוי. ממתינים מספר דקות להתייצבות הציפוי על המוס הקר. בעזרת סכין חדה מסירים נטיפים עודפים בתחתית העוגה. מעטרים בטיפות זהב : בקערית קטנה מערבבים אבקת זהב ואלכוהול. טובלים מברשת קטנה בנוזל המוזהב ומטפטפים מעל העוגה, מטלטלים את המברשת כך שהטיפות מתפזרות על כל פני העוגה. ממשיכים להשפריץ לפי טעמכם, גם על דפנות העוגה. מרימים את המוס בעדינות בעזרת מרית מדורגת או סכין גדולה ורחבה מאד, ומניחים על צלחת הגשה. מפזרים מעט אגוזים קצוצים בנקודת המפגש של המוס והצלחת, לגימור מושלם.`,
      category: "חלבי",
      favorite: false,
      img: "/Images/38.jpg"
    },
    {
      id: 39,
      name: "פיצה שוקולד",
      time: "20 דקות",
      ingredients: [
        {
          title: "לבצק פיצה",
          ingredientsList: [
            "1/2 קג' קמח",
            "כף שמרים יבשים או 25 גר' שמרים טריים",
            "½ כף מלח",
            "2 כפות סוכר",
            "¼ כוס שמן",
            "¼ 1 כוסות מים"
          ]
        },
        {
          title: "לתוספות",
          ingredientsList: ["300 גר' שוקולד חלב",
            "100 גר' שוקולד מריר",
            "חב' שמנת מתוקה"
          ]
        },
        {
          title: "לקישוט",
          ingredientsList: [
            "מרשמלו",
            "עוגיות",
            "עדשים",
            "בייגלה",
            "שוקולד לבן מומס…"
          ]
        }
      ],
      description: "בקערת מיקסר עם וו לישה מניחים את כל הרכיבים למעט המים: קמח, שמרים, מלח סוכר ושמן. מערבבים כדקה. מוסיפים כוס מים בהדרגה וממשיכים ללוש. אם נשארו חלקים יבשים בתחתית הקערה מוסיפים את ¼ כוס המים הנותרים בהדרגה עד שהבצק מתאחד.\nממשיכים ללוש במהירות נמוכה כ 10 דקות לקבלת בצק נעים ומעט דביק.\nמשמנים מעט את פני הבצק, מכניסים את הקערה לשקית ניילון גדולה ומתפיחים עד להכפלת הנפח, כשעה וחצי- שעתיים.\nמחלקים את הבצק ל 2 חלקים. מרדדים כל חלק לעיגול בקוטר כ 35 סמ, משאירים שוליים מעט יותר עבות. מתפיחים כרבע שעה. גוזרים ניר אפיה לעיגול בקוטר הפיצה (ללא השוליים), אותו מניחים במרכז הפיצה , ועליו צלחת שתשמור שהבצק לא יתפח יותר מדי במרכז אלא רק בקצוות.\nאופים את הפיצה בתנור מחומם ל 180 מע 5 דקות, מסירים את הצלחת ממרכז הפיצה ואופים 5 דקות נוספות.\nמכינים גנאש שוקולד חלב: מרתיחים שמנת מתוקה, מוסיפים שוקולדים קצוצים. ממתינים דקה וטורפים היטב לקבלת גנאש חלק.\nמוציאים את הפיצות , מורחים על כל פיצה מחצית מכמות הגנאש, ומפזרים את התוספות : מרשמלו חתוך לטבעות קטנות, עוגיות, עדשים או בייגלה. מכניסים את הפיצה לאפיה של 5 דקות נוספות בתנור. מוציאים וחותכים.",
      category: "קינוחים",
      favorite: false,
      img: "/Images/39.jpg"
    },
    {
      id: 40,
      name: "עוגת שוק שוקולד",
      time: "שעה",
      ingredients: [
        {
          title: "לעוגת שוקולד",
          ingredientsList: [
            "10 ביצים מופרדות",
            "1/2 כוס סוכר (100 גר')",
            "500 גר' שוקולד מריר",
            "250 גר' חמאה / מחמאה או 200 גר' שמן קוקוס",
            "40 גר' קורנפלור (4 כפות שטוחות)"
          ]
        },
        {
          title: "לגנאש שוקולד",
          ingredientsList: [
            "100 גר' שוקולד מריר קצוץ",
            "100 גר' שמנת מתוקה / צמחית (קצת פחות מחצי כוס)"
          ]
        },
        {
          title: "לעיטור גדר שוקולד",
          ingredientsList: [
            "250 גר' שוקולד",
            "שקף לעוגה"
          ]
        }
      ],
      description: "בקערת מיקסר עם בלון הקצפה מקציפים חלבונים עם מחצית מכמות הסוכר למרנג יציב.\nממיסים חמאה / מחמאה / שמן קוקוס במיקרו יחד עם השוקולד המריר, מערבבים כל 30 שניות לקבלת תערובת נוזלית.\nבקערת מיקסר נוספת מקציפים חלמונים עם יתרת הסוכר כ 5 דקות לקבלת קציפה תפוחה. מוסיפים קורנפלור ואת תערובת השוקולד החמימה ומערבלים לאיחוד.\nמקפלים את קצף החלבונים לתערובת במהירות איטית ובהדרגה, עד שהכל נטמע בתערובת. מעבירים את העיסה השוקולדית לתבנית קפיצית או לרינג עטוף בניר כסף המונח על מגש או תבנית תנור.\nאופים בתנור מחומם ל 150 מעלות לאפיה של חצי שעה בלבד, עד שהעוגה מתייצבת בדפנות, אך עדיין רוטטת במרכזה. חשוב לא לאפות יותר מדי! מצננים היטב.\nעד כאן העוגה. באמת כלום עבודה. אפשר להגיש אותה כך ולפדר במעט קקאו לפני ההגשה, אפשר לעטר בסתם קצפת, או להמשיך לקרוא את השדרוגים הבאים:\nמעבירים את העוגה לצינון במקפיא לחצי שעה.\nבינתיים מכינים גנאש: מביאים לרתיחה את השמנת , יוצקים על השוקולד הקצוץ, ממתינים דקה וטורפים לקבלת גנאש חלק. יוצקים את הגנאש על פני העוגה ומטלטלים את התבנית לפיזור אחיד וחלק. מחזירים להקפאה של חצי שעה נוספת (אפשר להקפיא את העוגה כך לטווח ארוך יותר ולסיים את הקישוטים רק לפני ההגשה). אפשר לשמור מעט גנאש בשק זילוף לעיטור הסופי העוגה.\nמחלצים את העוגה מהרינג או התבנית. מניחים על צלחת הגשה.\nמעטרים בגדר שוקולד: ממיסים שוקולד מריר במיקרו בפולסים של 30 שניות. בינתיים מכינים את השקף: גוזרים רצועת שקף לעוגה על פי היקף התבנית שאפינו בה. מניחים את רצועת השקף מעל ניירות אפיה (כדי לא ללכלך את כל האיזור…)\nכשהשוקולד הומס לחלוטין, מעבירים מספר כפות לשק זילוף (לטובת הקישוטים הנוספים) יוצקים את השוקולד הנותר על מרכז השקף לכל אורכו. משטחים את השוקולד לשכבה אחידה בעזרת פלטה מדורגת עד שהשוקולד מכסה את כל פני השקף. מרימים את השקף בשתי ידיים, עוטפים ומצמידים את הצד עם השוקולד המומס לצידי העוגה. מחברים את קצוות השקף. מעבירים למקרר למספר דקות עד להתקשות השוקולד.\nכשהשוקולד קשה לגמרי, מסירים בעדינות את השקף.\nגוזרים פתח קטן מאד בשק הזילוף המכיל שוקולד מומס (ששמרנו קודם) מזלפים את השוקולד בעיגולים גדולים ורבים מעל פני העוגה. מצמידים אליו עיטורים שונים: אגוזים עם מעט אבקת זהב, שאריות עוגת ספוג במיקרו (זוכרים אותה? אצלי היא הפכה לדיירת קבע במקפיא), טיפות גנאש (אם שמרתם) פירורי עוגיות או קקאו גרוס , פניני שוקולד ועוד ועוד.\nהעוגה במיטבה כשהיא מוגשת בטמפרטורת חדר, ולא קפואה.",
      category: "קינוחים",
      favorite: false,
      img: "/Images/40.jpg"
    }
  ]
}

const recipeSlice = createSlice({
  name: "recipes",
  initialState: initialValue,
  reducers: {
    updateFavorite: (state, actions) => {
      const currentRecipe = state.Recipes.find((item) => item.id === actions.payload)
      currentRecipe.favorite = !currentRecipe.favorite
    },
    addRecipe: (state, actions) => {
      state.Recipes.push(actions.payload);
    }
  }
})

export const { updateFavorite, addRecipe } = recipeSlice.actions
export default recipeSlice.reducer